[{"id": null, "metadata": {"doc_id": "77c83deb-361d-4452-aaac-234100ee9c1c", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This appears to be a reference to an instruction manual for models FS 120, 120 R, and 250, likely related to products from the brand TIHL. The manual is in English and spans pages 2 to 42. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "FS 120, 120 R, 250\n\n& TIHL\n\n2 - 42 Instruction Manual\n\nEnglish", "77c83deb-361d-4452-aaac-234100ee9c1c"]
[{"id": null, "metadata": {"doc_id": "67c0266c-2a97-46d6-b26d-93369ceaee4d", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text is an excerpt from a user manual, specifically a guide on how to use the manual for a machine. It includes the following sections:\n\n1. **Pictograms**: Describes the meanings of various pictograms that may be attached to the machine, such as those indicating the fuel tank, decompression valve, manual fuel pump, grease tube, intake air for different seasons, and handle heating.\n\n2. **Symbols in Text**: Explains the significance of symbols used within the text:\n   - **WARNING**: Indicates a risk of accident, personal injury, or serious property damage.\n   - **NOTICE**: Indicates a risk of damaging the machine or its components.\n\n3. **Engineering Improvements**: States that STIHL continually improves its products, which may result in design, engineering, and appearance changes that are not covered in the manual.\n\n4. **Safety Precautions and Working Techniques**: Emphasizes the importance of reading and understanding the User Manual to avoid serious or fatal injuries due to the high-speed, fast-cutting nature of the machine. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "1 1.1\n\nGuide to Using this Manual\n\nPictograms\n\nThe meanings of the pictograms attached to the machine are explained in this manual.\n\nDepending on the model concerned, the follow‐ ing pictograms may be attached to your machine.\n\nFuel tank; fuel mixture of gasoline and engine oil\n\n2\n\nOperate decompression valve  Manual fuel pump  Operate manual fuel pump  Tube of grease  Intake air: Summer operation  Intake air: Winter operation  Handle heating  1.2  Symbols in text  WARNING  0 0 0 0 0 0 7 2 8 0 _ 0 2 2 _ G B  P a p e r     i  s     r e c y c a b e .  l  l  O  r i g n a  i  l     I n s t r u c t i o n M a n u a     l  P  r i n t e d o n        c h o r i n e - f r e e  l     p a p e r \n\nOperate decompression valve\n\nWarning where there is a risk of an accident or personal injury or serious damage to property.\n\nNOTICE\n\nCaution where there is a risk of damaging the machine or its individual components.\n\n1.3 Engineering improvements\n\nSTIHL's philosophy is to continually improve all of its products. For this reason we may modify the design, engineering and appearance of our products periodically.\n\nTherefore, some changes, modifications and improvements may not be covered in this man‐ ual.\n\nSafety Precautions and Working Techniques\n\n2\n\n!\n\nBecause the machine is a high-speed fast-cutting power tool, special safety precautions must be observed to reduce the risk of personal injury. It is important that you read and understand the User Manual before commissioning and keep it in a safe place for future reference. Non-com‐ pliance with the User Manual may cause serious or even fatal injury.\n\n0458-250-0121-F\n\n0 4 5 8 - 2 5 0 - 0 1 2 1 - F\n\n“€TH'EVA\n\n© A N D R E A S S T H L A G & C o .", "67c0266c-2a97-46d6-b26d-93369ceaee4d"]
[{"id": null, "metadata": {"doc_id": "3eba9242-c6f7-43bb-b112-3c86936f5bb5", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides detailed safety precautions and working techniques for using a power tool, specifically a model by STIHL. Key points include:\n\n1. **Regulations and Training**: Follow local safety regulations and seek training if inexperienced.\n2. **Restrictions**: Minors under 16, children, animals, and bystanders should not use or be near the machine.\n3. **Responsibility**: Users are responsible for accidents involving third parties.\n4. **Manual**: Always provide the User Manual when lending or renting the tool.\n5. **Health and Condition**: Operators must be in good health, sober, and not under the influence of drugs or alcohol.\n6. **Usage**: Use the tool only for its intended purposes, such as cutting grass and small trees, and only with approved attachments.\n7. **Modifications and Cleaning**: Do not modify the tool or use high-pressure washers for cleaning.\n8. **Safety Gear**: The provided guard may not protect against all ejected objects, which can ricochet.\n\nThe text emphasizes the importance of proper use, maintenance, and adherence to safety guidelines to prevent accidents and injuries. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "I\n\nK G 2 0 2 3\n\n2 Safety Precautions and Working Techniques\n\nObserve all applicable local safety regulations, e.g. by trade organizations, social insurance institutions, labor safety authorities etc.\n\nIf you have never used a power tool before: Have your dealer or other experienced user show you how to operate your machine – or attend a special course to learn how to operate it.\n\nMinors should never be allowed to use the machine – except for apprentices over the age of 16 when working under supervision.\n\nChildren, animals and bystanders must remain at a distance.\n\nWhen not using the machine, it must be laid down in such a way that it does not endanger anyone. Ensure that the machine cannot be used without authorization.\n\nThe user is responsible for accidents or risks involving third parties or their property.\n\nDo not lend or rent your power tool without the User Manual. Be sure that anyone using it under‐ stands the information contained in this manual.\n\nThe use of machines that emit noise may be limi‐ ted to certain hours of the day as specified by national and/or regional or local regulations.\n\nAnyone operating the machine must be well res‐ ted, in good physical health and in good mental condition.\n\nIf you have any condition that might be aggrava‐ ted by strenuous work, check with your doctor before operating a machine.\n\nIf you have a pacemaker: The ignition system of your machine produces an electromagnetic field of very low intensity. This field may interfere with some pacemakers. STIHL recommends that per‐ sons with pacemakers consult their physician and the pacemaker manufacturer to reduce any health risk.\n\nAnyone who has consumed alcohol or drugs or medicines affecting their ability to react must not operate a power tool.\n\nDepending on the cutting attachment fitted, use your power tool only for cutting grass, wild growth, shrubs, scrub, bushes, small diameter trees and similar materials.\n\nThe machine must not be used for any other pur‐ poses – risk of accidents!\n\nOnly use cutting attachments and accessories that are explicitly approved for this power tool\n\n0458-250-0121-F\n\nEnglish\n\nmodel by STIHL or are technically identical. If you have any questions in this respect, consult your dealer. Use only high quality parts and accessories. in order to avoid the risk of acci‐ dents and damage to the machine.\n\nSTIHL recommends the use of original STIHL tools and accessories. They are specifically designed to match the product and meet your performance requirements.\n\nNever attempt to modify your power tool in any way since this may increase the risk of personal injury. STIHL excludes all liability for personal injury and damage to property caused while using unauthorized attachments.\n\nDo not use a high-pressure washer to clean the power tool. The solid jet of water may damage parts of the unit.\n\nThe guard provided with your machine may not protect the operator from all foreign objects (gravel, glass, wire etc.) ejected by the revolving cutting attachment. Ejected objects may also ric‐ ochet and strike the operator.", "3eba9242-c6f7-43bb-b112-3c86936f5bb5"]
[{"id": null, "metadata": {"doc_id": "4b30939c-ae14-4149-ae1b-e4b6828f8502", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides safety guidelines for clothing, equipment, transporting, and refueling when operating machinery.\n\n**Clothing and Equipment:**\n- Wear sturdy, close-fitting clothing (e.g., boiler suit) to avoid entanglement.\n- Avoid loose clothing, scarves, neckties, and jewelry; tie up long hair.\n- Use safety boots with steel toe caps and non-slip soles; sturdy shoes are acceptable for mowing heads.\n- Wear safety glasses (EN 166 standard), face protection, ear defenders, a safety hard hat, and sturdy gloves.\n- STIHL offers a range of personal protective equipment.\n\n**Transporting the Machine:**\n- Stop the engine before transporting.\n- Carry the machine balanced on the harness or shaft.\n- Use a transport guard on the cutting attachment to prevent injuries.\n- Avoid touching hot parts to prevent burns.\n- Secure the machine properly in a vehicle to prevent turnover, damage, and fuel spillage.\n\n**Refueling:**\n- Gasoline is highly flammable; avoid naked flames and do not smoke.\n- Shut off the engine before refueling and avoid refueling a hot engine.\n- Open the fuel cap carefully to release pressure and prevent spillage.\n- Refuel in a well-ventilated area and clean any spilled fuel immediately.\n- Tighten the fuel cap securely to prevent leaks and check for leaks before starting the engine to avoid serious burns. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "2.1 Clothing and equipment\n\nWear proper protective clothing and equipment.\n\nClothing must be sturdy but allow complete freedom of movement. Wear close-fitting clothes such as a boiler suit, not a loose jacket.\n\nDo not wear clothing which could become trapped in wood, brush or moving parts of the machine. Do not wear a scarf, necktie or jewelry. Tie up and confine long hair above your shoulders. Wear safety boots with steel toe caps and non-slip soles.\n\nSturdy shoes with non-slip shoes are permissible only when using mowing heads.\n\nWARNING\n\naa (GS —\n\nTo reduce the risk of eye injuries, wear close-fitting safety glasses in accordance with European Standard EN 166. Make sure the safety glasses are a snug fit.\n\nWear face protection and make sure it is a good fit. Face protection alone is not sufficient to pro‐ tect the eyes.\n\nWear \"personal\" sound protection, e.g. ear defenders.\n\n3\n\nEnglish\n\nWear a safety hard hat for thinning operations, when working in high scrub and where there is a danger of head injuries from falling objects.\n\nWear sturdy protective gloves made of a resistant material (e. g. leather).\n\nSTIHL can supply a comprehensive range of per‐ sonal protective equipment.\n\n2.2 Transporting the machine\n\nVth Vw [| Ws tn hth & 8\n\nZz x 2 5 a a 8\n\nAlways stop the engine.\n\nCarry the machine hanging on the harness or by the shaft so that it is balanced.\n\nTo reduce the risk of cut injuries, fit transport guard on the cutting attachment, even when car‐ rying the tool for short distances – see also \"Transporting the Unit\".\n\nAvoid touching hot parts of the machine and gearbox – risk of burns!\n\nBy vehicle: When transporting in a vehicle, prop‐ erly secure your machine to prevent turnover, damage and fuel spillage.\n\n2.3\n\nRefueling Gasoline is an extremely flammable fuel. Keep clear of naked flames. Do not spill any fuel – do not smoke.\n\n4\n\n2 Safety Precautions and Working Techniques\n\nAlways shut off the engine before refueling.\n\nDo not fuel a hot engine – fuel may spill and cause a fire.\n\nOpen the fuel cap carefully to allow any pressure build-up in the tank to release slowly and avoid fuel spillage.\n\nOnly refuel the machine in a well ventilated place. If fuel has been spilled, immediately clean the machine – do not allow your clothes to be splashed with fuel. If that happens, change your clothes at once.\n\nES N —\n\nAfter refueling, close the fuel cap as tightly as possible.\n\nThis helps reduce the risk of unit vibrations caus‐ ing an incorrectly tightened fuel cap to loosen or come off and spill quantities of fuel.\n\nCheck for leaks. Do not start the engine if there is a fuel leak – serious or fatal burns could result!", "4b30939c-ae14-4149-ae1b-e4b6828f8502"]
[{"id": null, "metadata": {"doc_id": "e335ef72-5e50-429a-ba48-103908297ead", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text outlines safety precautions and procedures for using a power tool. Key points include:\n\n1. **Pre-Start Checks**:\n   - Ensure the tool is properly assembled and in good condition.\n   - Inspect the fuel system for leaks and ensure all parts are secure.\n   - Verify that the control switches and throttle mechanisms function correctly.\n   - Check the spark plug boot and cutting attachments for proper fitting and condition.\n   - Replace any damaged parts and do not use the machine if it is damaged.\n\n2. **Safety Precautions**:\n   - Do not modify controls or safety devices.\n   - Keep handles clean and dry.\n   - Adjust the harness and handle to fit your height and reach.\n   - Practice emergency procedures with the harness.\n\n3. **Starting the Engine**:\n   - Start the engine at least 3 meters away from the fueling spot, outdoors.\n   - Ensure the unit is on firm ground and the cutting attachment is clear of obstructions.\n   - Maintain a safe distance of 15 meters from others when starting the tool.\n   - Avoid contact with the cutting attachment and do not drop-start the tool.\n   - Ensure the cutting attachment stops moving when the engine idles.\n   - Keep combustible materials away from hot exhaust gases and surfaces to prevent fire.\n\nThese guidelines emphasize the importance of safety and proper maintenance to prevent accidents and injuries. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "2.4 Before starting\n\nCheck that your power tool is properly assem‐ bled and in good condition – refer to appropriate chapters in the User Manual. – Check the fuel system for leaks, especially the visible parts, e. g., fuel cap, hose connections, manual fuel pump (only in machines with a manual fuel pump). In case of leakage and damage, do not start the engine – risk of fire! Have the machine serviced by a dealer before using it\n\n– Use only an approved combination of cutting attachment, deflector, handle and harness. All parts must be assembled properly and securely\n\n– Slide control / stop switch must move easily to STOP or 0\n\n– Throttle trigger lockout (if installed) and throttle trigger must move easily – the throttle trigger must return to the idle position automatically – Check that the spark plug boot is secure – a loose boot may cause sparking that could ignite combustible fumes and cause a fire! – Cutting attachment or interchangeable attach‐ ment: correctly fitted, secure and in perfect condition\n\nattachments, rider plate) for damage and/or wear. Always replace damaged parts. Do not use the machine with a damaged deflector or worn rider plate (if the writing and arrows are no longer discernible)\n\n0458-250-0121-F\n\n2 Safety Precautions and Working Techniques\n\n– Never attempt to modify the controls or safety devices\n\n– Keep the handles dry and clean – free from oil and dirt – this is important for safe control of the machine\n\n– Adjust the harness and handle(s) to suit your height and reach Observe the chapter \"Fitting the Harness\" – \"Balancing the machine\"\n\nTo reduce the risk of personal injury, do not operate your power tool if it is damaged or not properly assembled!\n\nTo prepare for emergencies when using a har‐ ness: Practice setting down the machine quickly. To avoid damage, do not throw the unit to the ground when practicing.\n\n2.5 Starting the engine\n\nStart the engine at least 3 meters from the fuel‐ ing spot, outdoors only.\n\nPlace the unit on firm ground in an open area. Make sure you have good balance and secure footing. Hold the unit securely. The cutting attachment must be clear of the ground and all other obstructions because it may begin to run when the engine starts.\n\nThis is a one-person machine – ensure that there is no-one within 15 meters of the machine, not even when starting the power tool! Risk of injury due to ejected objects!\n\nAvoid contact with the cutting attach‐ ment – risk of injury!\n\nDo not drop-start the power tool – start the engine as described in the User Manual. The cutting attachment runs on for a short while after releas‐ ing the throttle trigger – coasting effect!\n\nCheck engine idling: The cutting attachment must remain at a standstill when the engine idles – throttle trigger released.\n\nKeep easily combustible materials (e. g., wood chips, bark, dry grass, fuel) away from hot exhaust gases and hot muffler surfaces – risk of fire!", "e335ef72-5e50-429a-ba48-103908297ead"]
[{"id": null, "metadata": {"doc_id": "604bdc0d-007c-4ae2-aac1-7e1b806422d9", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides safety guidelines for operating a power machine, emphasizing proper handling, balance, and precautions during use. Key points include:\n\n1. **Holding the Machine**:\n   - Use both hands on the handles.\n   - Maintain good balance and secure footing.\n   - Specific instructions for versions with bike handles and loop handles.\n\n2. **While Working**:\n   - Ensure balance and secure footing.\n   - Switch off the engine immediately in danger or emergency.\n   - Maintain a 15-meter safety radius to avoid accidents from ejected objects.\n   - Regularly check and adjust the engine idle speed.\n   - Be cautious in slippery conditions and watch for obstacles.\n   - Only work from the ground, not from ladders or elevated platforms.\n   - Be alert when using hearing protection.\n   - Take breaks to avoid fatigue.\n   - Work in good visibility and daylight conditions.\n   - Ensure proper ventilation to avoid toxic exhaust gases.\n   - Stop work if experiencing symptoms of exhaust gas exposure.\n   - Minimize noise and emissions, and avoid smoking near the tool.\n   - Wear respiratory protection if exposed to heavy dust or smoke.\n   - Check the tool's condition after heavy impacts or falls.\n   - Do not use the starting throttle position during operation.\n\nThese guidelines aim to ensure safe and efficient use of the power machine, reducing the risk of accidents and health hazards. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "2.6 Holding and guiding the machine\n\nAlways hold the unit firmly with both hands on the handles.\n\nMake sure you always have good balance and secure footing.\n\n0458-250-0121-F\n\nEnglish\n\n2.6.1 For versions with bike handle\n\n/ 2 x 1 8 2 [ea 8 o\n\nRight hand on control handle, left hand on grip on handlebar.\n\n2.6.2 For versions with loop handle\n\nZz x 3 is} Fs qi AN 3\n\nFor versions with loop handle and loop handle with barrier bar, left hand on the loop handle, right hand on the control handle – even if you are left-handed.\n\n2.7 While working\n\nMake sure you always have good balance and secure footing.\n\nIn the event of impending danger or in an emer‐ gency, switch off the engine immediately - move the slide control/stop switch to STOP or 0.\n\nto\n\nWithin a wide area around the workplace, there is a risk of accident by ejected objects, therefore ensure that there is no-one within a 15 m radius of the machine. This distance must also be main‐ tained in relation to objects (vehicles, window panes) – risk of property damage! Even at a dis‐ tance over 15 m, danger cannot be ruled out.\n\nCheck that the engine is properly idling so that the cutting tool will not continue rotating after you release the throttle trigger.\n\nCheck and correct the idle speed setting at regu‐ lar intervals. If the cutting attachment still rotates at idle speed, have your dealer make proper\n\n5\n\nEnglish\n\nadjustments or repairs. STIHL recommends you have this work done by a STIHL servicing dealer.\n\nTake special care in slippery conditions – damp, snow, ice, on slopes or uneven ground.\n\nWatch out for obstacles: tree stumps, roots – risk of tripping or stumbling!\n\nOnly work while standing on the ground, never on a ladder or mobile elevated work platform.\n\nBe particularly alert and cautious when wearing hearing protection because your ability to hear warnings (shouts, alarms, etc.) is restricted.\n\nTake breaks when you start getting tired or feel‐ ing fatigue – risk of accidents!\n\nWork calmly and carefully – in daylight conditions and only when visibility is good. Proceed with caution, do not put others in danger.\n\nAs soon as the engine is running, the power machine generates toxic exhaust gas.As soon as the engine is running, the power machine gener‐ ates toxic exhaust gas. These gases may be odorless and invisible and may contain unburned hydrocarbons and benzene. Never run the engine indoors or in poorly ventilated loca‐ tions, even if your model is equipped with a catalytic converter.\n\nTo reduce the risk of serious or fatal injury from breathing toxic fumes, ensure proper ventilation when working in trenches, hollows or other con‐ fined locations.\n\nStop work immediately if you start suffering from nausea, headaches, impaired vision (e.g. your field of vision gets smaller), impaired hearing, dizziness, or impaired concentration – these symptoms may possibly be the result of too-high exhaust gas concentration – Risk of accidents!\n\nOperate your power tool so that it produces a minimum of noise and emissions – do not run the engine unnecessarily, accelerate the engine only when working.\n\nTo reduce the risk of fire, do not smoke while operating or standing near your power tool. Com‐ bustible fuel vapor may escape from the fuel sys‐ tem.\n\nDust, fumes and smoke produced while working may be hazardous to health. Wear respiratory protection in case of heavy dust or smoke emis‐ sion.\n\nIf your power tool is subjected to unusually high loads for which it was not designed (e.g. heavy\n\n6\n\n2 Safety Precautions and Working Techniques\n\nimpact or a fall), always check that it is in good condition before continuing work – see also \"Before Starting\".\n\nCheck in particular that the fuel system has no leaks and the safety equipment is fully operative. Never use a power tool that is no longer safe to operate. In case of doubt, contact a dealer.\n\nDo not operate your power tool in the starting throttle position – engine speed cannot be con‐ trolled in this position.", "604bdc0d-007c-4ae2-aac1-7e1b806422d9"]
[{"id": null, "metadata": {"doc_id": "973f108f-72bb-4c87-bbc6-dbbc8bbf4bf6", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides safety precautions and working techniques for operating a cutting unit. Key points include:\n\n1. **Deflector Use**: Always use the proper deflector to prevent injury from ejected objects.\n2. **Work Site Check**: Inspect the area for rocks and metal objects that could be ejected and cause injury or damage.\n3. **Terrain Caution**: Be extra careful in dense or difficult terrain.\n4. **Mowing Height**: Maintain a cutting height of at least 15 cm to protect animals.\n5. **Engine Shutdown**: Always turn off the engine before leaving the unit unattended.\n6. **Attachment Inspection**: Regularly check the cutting attachment for damage, sharpness, and secure fitting. Replace damaged or blunt attachments immediately.\n7. **Cleaning**: Regularly clean grass and plant residue from the cutting attachment and deflector.\n8. **Engine Off for Maintenance**: Turn off the engine before replacing the cutting attachment.\n9. **Gearbox Caution**: Avoid touching the hot gearbox to prevent burns.\n10. **Fire Risk**: Avoid using the unit near combustible materials, especially in hot and dry conditions, and consult the forestry office about fire hazards.\n\nThese guidelines aim to ensure safe and efficient operation while minimizing the risk of injury and fire. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "SO\n\nTo reduce the risk of injuryfrom ejec‐ ted objects, never operate the unit without the proper deflector for the type of cutting attachment being used. Check the work site – rocks, metal objects etc. may be caught up and ejected – possibly over a distance of 15 m – risk of injury! – They can also damage the cutting attachment and other property (e. g. parking vehicles, windows).\n\nBe particularly careful when working on difficult, densely grown terrain.\n\nWhen mowing in high shrubbery, under shrub‐ bery and hedges: Hold the cutting tool at a work‐ ing height of at least 15 cm – avoid risks to ani‐ mals.\n\nAlways shut off the engine before leaving the unit unattended.\n\nExamine the cutting attachment periodically at short intervals and as soon as you note any noticeable changes: – Stop the engine, hold the machine securely,\n\n— Stop the engine, hold the machine securely, allow the cutting attachment to come to a stop\n\nallow the cutting attachment to come to a stop – Check condition and secure fitting; watch out\n\nfor cracks\n\n– Ensure that the cutting blades are sharp – Replace damaged or blunt cutting attachments immediately, even in the event of minor hair‐ line cracks\n\nClean grass and plant residue off the cutting attachment mounting at regular intervals – remove any accumulated material from the cut‐ ting attachment and deflector.\n\nTo reduce the risk of injury, shut off the engine before replacing the cutting attachment.\n\nThe gearbox gets hot during opera‐ tion. Never touch the gearbox – risk of burns!\n\n0458-250-0121-F\n\n2 Safety Precautions and Working Techniques\n\nIf a rotating cutting attachment touches a rock or another hard object, sparks can be generated which may possibly ignite combustible materials. Also dried-out plants and brushwood are com‐ bustible, above all in hot and dry weather. If there is a risk of fire, do not use cutting attach‐ ments in the vicinity of combustible materials, dried-out plants or brushwood. It is mandatory that you ask the responsible forestry office about current fire hazards.", "973f108f-72bb-4c87-bbc6-dbbc8bbf4bf6"]
[{"id": null, "metadata": {"doc_id": "f80d94c9-8cb1-4b9f-af90-c70cc55accc7", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides safety and usage guidelines for mowing heads and metal cutting attachments. \n\n**For mowing heads:**\n- Extend the deflector as specified in the User Manual.\n- Use a deflector with a properly fitted blade to limit the mowing line length.\n- Turn off the engine before adjusting manually adjustable mowing heads to avoid injury.\n- Avoid using excessively long mowing lines to prevent engine damage and overheating.\n\n**For metal cutting attachments:**\n- Use original STIHL metal cutting attachments for optimal performance.\n- Regularly sharpen metal cutting attachments to avoid imbalance and excessive machine load.\n- Inspect attachments for damage after contact with hard objects and remove any burrs or accumulated material.\n- Do not use or repair damaged attachments by welding or modifying them.\n- Ensure the attachment is not too large, heavy, and is made of high-quality materials.\n- Non-STIHL attachments must match the specifications of approved STIHL attachments to avoid injury. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "2.8 Using mowing heads\n\nExtend the cutting attachment deflector with the attached parts specified in the User Manual.\n\nOnly use a deflector with a properly fitted blade that limits the mowing line to the permissible length.\n\nFor manually adjustable mowing heads, always switch off the engine before adjusting the mow‐ ing line – risk of injury!\n\nMisuse with mowing lines that are too long reduces the working speed of the engine. The constant slipping of the clutch causes overheat‐ ing and damage to important components (e. g. clutch, plastic housing parts) – e. g. due to the cutting attachment rotating during idling – risk of injury!\n\n2.9 When using metal cutting attachments\n\nSTIHL recommends the use of original STIHL metal cutting attachments. These have been optimized for the machine and the user’s require‐ ments.\n\nMetal cutting attachments rotate very fast, gener‐ ating forces acting on the attachments and on the cuttings.\n\nMetal cutting attachments must be sharpened in regular intervals in accordance with the instruc‐ tions.\n\nUnevenly sharpened metal cutting attachments generate an imbalance which may cause extreme loads on the machine – risk of break‐ age!\n\nDull or improperly sharpened cutting edges can put a higher load on the cutting attachment and increase the risk of injuryfrom cracked or broken parts.\n\nAfter each contact of the metal cutting attach‐ ment with hard objects (e.g. stones, rocks, metal parts), check it for damage (e.g. tears and defor‐\n\n0458-250-0121-F\n\nEnglish\n\nmation). To reduce the risk of injury, remove burrs and other visible accumulated material because they may become detached and ejec‐ ted at high speed during operation.\n\nDo not continue using or attempt to repair dam‐ aged or cracked cutting attachments by means of welding, straightening or modifying the shape (unbalanced).\n\nParticles or pieces may come off and hit the operator or a bystander at a high speed – risk of most severe injuries!\n\nTo reduce the above-named risks involved in operating a metal cutting attachment, ensure that the diameter of your metal cutting attachment is not too big. Also, the attachment must not be too heavy. It must be made of high-quality materials and have a suitable geometry (shape, thickness).\n\nA metal cutting attachment not made by STIHL must not have a different weight, thickness, shape or a larger diameter than the largest STIHL metal cutting attachment approved for this metal cutting attachment – risk of injury!", "f80d94c9-8cb1-4b9f-af90-c70cc55accc7"]
[{"id": null, "metadata": {"doc_id": "653fc9c1-3a98-4c90-a35f-c9b08b109ee0", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "### Summary\n\n**Vibrations (2.10):**\n- Prolonged use of power tools can cause vibration-induced circulation problems in hands (whitefinger disease).\n- Usage duration varies based on factors like hand protection (e.g., warm gloves) and work breaks, which can prolong usage, while poor circulation, cold temperatures, and tight grip can shorten it.\n- Regular users should monitor hand and finger conditions and seek medical advice if symptoms like tingling appear.\n\n**Maintenance and Repairs (2.11):**\n- Regular servicing is essential; only perform maintenance described in the manual.\n- STIHL recommends using authorized dealers for repairs and genuine STIHL parts to ensure safety and performance.\n- Always shut off the engine before maintenance, except for carburetor and idle speed adjustments.\n- Avoid servicing near open flames and check the fuel filler cap for leaks.\n- Use approved spark plugs and inspect the ignition lead and muffler regularly.\n- Do not operate the machine with a damaged or missing muffler to prevent fire and hearing damage.\n- Check the condition of AV elements regularly as they influence vibration behavior. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "2.10 Vibrations\n\nProlonged use of the power tool may result in vibration-induced circulation problems in the hands (whitefinger disease).\n\nNo general recommendation can be given for the length of usage because it depends on several factors.\n\nThe period of usage is prolonged by: – Hand protection (wearing warm gloves) – Work breaks\n\nThe period of usage is shortened by: – Any personal tendency to suffer from poor cir‐ culation (symptoms: frequently cold fingers, tingling sensations).\n\n– Low outside temperatures. – The force with which the handles are held (a\n\ntight grip restricts circulation).\n\nContinual and regular users should monitor closely the condition of their hands and fingers. If any of the above symptoms appear (e.g. tingling sensation in fingers), seek medical advice.\n\n2.11 Maintenance and Repairs\n\nService the machine regularly. Do not attempt any maintenance or repair work not described in the instruction manual. Have all other work per‐ formed by a servicing dealer.\n\n7\n\nEnglish\n\nSTIHL recommends that you have servicing and repair work carried out exclusively by an author‐ ized STIHL servicing dealer. STIHL dealers are regularly given the opportunity to attend training courses and are supplied with the necessary technical information.\n\nOnly use high-quality replacement parts in order to avoid the risk of accidents and damage to the machine. If you have any questions in this respect, consult a servicing dealer.\n\nSTIHL recommends the use of genuine STIHL replacement parts. They are specifically designed to match your model and meet your performance requirements.\n\nTo reduce the risk of injury, always shut off the engine before carrying out any maintenance or repairs or cleaning the machine. – Exception: Carburetor and idle speed adjustments.\n\nDo not turn the engine over on the starter with the spark plug boot or spark plug removed unless the slide control / stop switch is on STOP or 0 since there is otherwise a risk of fire from uncontained sparking.\n\nTo reduce the risk of fire, do not service or store your machine near open flames.\n\nCheck the fuel filler cap for leaks at regular inter‐ vals.\n\nUse only a spark plug of the type approved by STIHL and make sure it is in good condition – see \"Specifications\".\n\nInspect the ignition lead (insulation in good con‐ dition, secure connection).\n\nCheck the condition of the muffler.\n\nTo reduce the risk of fire and damage to hearing, do not operate your machine if the muffler is damaged or missing.\n\nDo not touch a hot muffler since burn injury will result.\n\nVibration behavior is influenced by the condition of the AV elements – check the AV elements at regular intervals.", "653fc9c1-3a98-4c90-a35f-c9b08b109ee0"]
[{"id": null, "metadata": {"doc_id": "11b9e126-2157-40e0-b0b3-d5cb14406a3e", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides safety precautions and usage instructions for deflectors, harnesses, and mowing heads with nylon lines used in cutting attachments. Key points include:\n\n1. **Deflectors**:\n   - Arrows indicate the correct rotation direction.\n   - Symbols on deflectors show approved combinations with cutting attachments.\n   - Specific deflectors are suitable or unsuitable for mowing heads, grass cutting blades, brush knives, shredder blades, and circular saw blades.\n\n2. **Harness/Strap**:\n   - A shoulder strap or full harness is necessary for safe operation.\n   - Grass cutting blades and brush knives require a shoulder strap.\n   - Circular saw blades require a full harness with a quick-release system.\n\n3. **Mowing Head with Nylon Line**:\n   - Nylon line is recommended for soft cuts around trees and fence posts to avoid damage.\n   - Instructions for refilling the nylon line are provided with the mowing head.\n   - Using wire or metal-reinforced line instead of nylon line is dangerous and should be avoided. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "2.12 Symbols on Deflectors\n\nAn arrow on the deflector shows the correct direction of rotation of the cutting attachments.\n\nSome of the following symbols are applied to the outside of the deflector to indicate the approved combination of cutting attachment and deflector.\n\n8\n\n2 Safety Precautions and Working Techniques\n\nDeflector may be used with mowing heads.\n\nDeflector must not be used with mow‐ ing heads.\n\nDeflector may be used with grass cut‐ ting blades.\n\nDeflector must not be used with grass cutting blades.\n\nDeflector may be used with brush kni‐ ves.\n\nDeflector must not be used with brush knives.\n\nDeflector must not be used with shredder blades.\n\nDeflector must not be used with circu‐ lar saw blades.\n\n2.13 Harness / Strap\n\nThe harness is included in the scope of supply or available as a special accessory.\n\n002BA215 KN\n\n► Use a shoulder strap. ► With the engine running, attach the machine to\n\nthe shoulder strap.\n\nGrass cutting blades and brush knives must always be used in combination with a shoulder strap.\n\nCircular saw blades must always be used in combination with a full harness with a quick- release system.\n\n0458-250-0121-F\n\n2 Safety Precautions and Working Techniques\n\n2.14 Mowing Head with Nylon Line\n\nAUTTTLTRALOL LU UULUTRTACCU COG UGUTDCOCOORICUECURTATLAUN CONT NTU LOM LUO CG0 MUVUTITVONU UIA TURUITLUMea UOUOLAOICUTTA LU UHCAUULA UL CREO ULE COAOaLa cea CTAUITOSURLUULUONTODCGTTRDANULCUUULCLONGS TUNA LAAL LGD. mT LILLLALL NOOCUUUTOU COURT UUUOEOUTULLULOULO LCL LLUw Uilult CIVUOA UCLA LANA OCLTORUGLIDONGRLSCUROA CUCU CAMALULVUCELITCLCU ULE LUCE C2) eee POTHIER URANIUM TASC OR Cat CUETO CU TAR UOLUOM EL LU VAUUVLGLCT ACCT HELE] NUTELL {uILUL HULL ATU ILUUU TULL “EAE (cet TELA IMI ULEHULC 000BA015 KN\n\nNylon line achieves a soft cut for edging and trimming around trees, fence posts, etc. – less risk of damaging tree bark.\n\nThe mowing head comes with an instruction leaf‐ let. Refill the mowing head with nylon line as described in the instruction leaflet.\n\nWARNING\n\nTo reduce the risk of serious injury, never use wire or metal-reinforced line in place of the nylon line.", "11b9e126-2157-40e0-b0b3-d5cb14406a3e"]
[{"id": null, "metadata": {"doc_id": "08a2add6-009d-4aa5-b68b-178c37ba8a96", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides safety and usage instructions for various mowing and cutting attachments for STIHL equipment. \n\n1. **Polycut Mowing Head with Polymer Blades**:\n   - Designed for mowing unobstructed meadow edges.\n   - Check wear limit marks; replace if worn to avoid injury.\n   - Can be equipped with polymer blades or nylon line, but never use wire.\n   - Comes with instruction leaflets for proper setup.\n\n2. **Risk of Kickout with Metal Cutting Attachments**:\n   - Warning about the risk of kickout when metal blades hit solid objects.\n   - Kickout can cause the machine to be thrown in the opposite direction of blade rotation.\n\n3. **Grass Cutting Blade**:\n   - Intended for cutting grass and weeds.\n   - Use by sweeping in an arc like a scythe.\n   - Improper use can damage the blade and cause injury.\n   - Resharpen the blade when it becomes dull. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "STIHL Polycut Mowing Head with Polymer Blades\n\n2.15\n\nFor mowing unobstructed edges of meadows (without posts, fences, trees or similar obsta‐ cles).\n\nCheck the wear limit marks!\n\n0458-250-0121-F\n\nEnglish\n\n002BA049 KN\n\nIf one of the wear limit marks on the PolyCut mowing head is worn through (arrow): Do not continue using the mowing head. Install a new one. There is otherwise a risk of injury from thrown parts of the head.\n\nIt is important to follow the maintenance instruc‐ tions for the PolyCut mowing head.\n\nThe PolyCut can also be equipped with mowing line in place of the polymer blades.\n\nThe mowing head comes with instruction leaflets. Equip the mowing head with polymers blades or nylon line as described in the instruction leaflets.\n\nWARNING\n\nNever use wire in place of the nylon mowing line – risk of injury.\n\n2.16 Risk of Kickout (Blade Thrust) with Metal Cutting Attachments\n\nWARNING\n\nWhen using metal cutting attach‐ ments there is a risk of kickout when the rotating blade comes into contact with a solid object such as a tree trunk, branch, tree stump, rock or similar. The machine is thrown to the right or to the rear – opposite to the attachment's direction of rotation.\n\nCS O 002BA135 KN\n\n9\n\nEnglish\n\nThe risk of kickout is greatest when the black area of the rotating cutting attachment comes into contact with a solid object.\n\n2.17 Grass Cutting Blade\n\nUUULTRLU UA UU ACh ATE TU Lt UC PLETE UneVTLLECVUU TEP ELEVGCETPTLETLUYEUEE dec EEEECY EY TLE UNINC UIAALLUU LL UL EHH LLL GUUVEALY UUM TRETE ETE WE it Ut OOP Le ULL era teetest EL i Ms Sanne ll LUFT WCOOTTL UE Ieee A CEEOL LT VEEL SHELLEY LLL ye ACQUUULTEITITE IE eno FS lturit 2 CIUVELGLTLUT UALLU Lal LOCUULTLAULLAAL! LULL TROL ll LAL ALUN ALCUU ELA HELLA AU Ute LeULLUHT UAL wut < LEM 4 HOU LS [Pip (ieee LAT\n\nUse for grass and weeds only – sweep the brushcutter in an arc like a scythe.\n\nWARNING \n\nImproper use may damage the grass cutting blade – risk of injury from thrown parts.\n\nResharpen the grass cutting blade according to instructions when it has dulled noticeably.", "08a2add6-009d-4aa5-b68b-178c37ba8a96"]
[{"id": null, "metadata": {"doc_id": "28e55f8a-878f-4c47-8561-36042d1f01e6", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides safety precautions and working techniques for using a brush knife and a circular saw blade.\n\n**Brush Knife:**\n- **Usage:** For cutting matted grass, wild growth, scrub, and thinning young stands with a stem diameter of no more than 2 cm.\n- **Techniques:** Use like a scythe at ground level for grass; lower onto growth for shredding effect.\n- **Safety:** Keep below hip level, avoid contact with solid objects, inspect regularly, and resharpen as needed. Do not use on stems thicker than 2 cm.\n\n**Circular Saw Blade:**\n- **Usage:** Suitable for cutting shrubs and trees with a maximum stem diameter of 4 cm.\n- **Techniques:** Accelerate engine to full throttle before cutting, use uniform pressure, and ensure a matching limit stop.\n- **Safety:** Avoid contact with stones and the ground, resharpen in time, and maintain a safe distance when felling trees. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "2.18 Brush Knife\n\nFor cutting matted grass, wild growth and scrub and thinning young stands with a stem diameter of no more than 2 cm – do not cut thicker stems – risk of accidents.\n\n10\n\n2 Safety Precautions and Working Techniques\n\nUUM LLL WUUULLE CLT Lit Lit LLUiLiLil( ise Mi ts COELTELIVC LUT CLOT PEM LEL L Atid 6% itil Wt ner tu IL DJL ih Be a sitll tl q {IMI rh (LE WLLL TTL ravi (UH Heononseyiy 2 CLL 3 Walls 8 8 ULLLUCUL LLL\n\nUse the brushcutter like a scythe (sweep it to the right and left) at ground level when cutting grass and thinning young stands.\n\nTo cut wild growth and scrub, lower the brush knife down onto the growth to achieve a shred‐ ding effect – always keep the cutting attachment below hip level during this process.\n\nExercise extreme caution when using this method of cutting. The higher the cutting attach‐ ment is off the ground, the greater the risk of injury from cuttings being thrown sideways.\n\nWarning! Improper use of a brush knife may cause it to crack, chip or shatter – risk of injury from thrown parts.\n\nTo reduce the risk of injury it is essential to take the following precautions: – Avoid contact with stones, rocks, pieces of\n\nmetal and other solid foreign objects.\n\n– Never cut wood or shrubs with a stem diame‐ ter of more than 2 cm – use a circular saw blade for such work.\n\n– Inspect the brush knife at regular short inter‐ vals for signs of damage. Do not continue working with a damaged brush knife. – Resharpen the brush knife regularly and\n\nwhenever it has dulled noticeably, and have it balanced if necessary (STIHL recommends a STIHL servicing dealer).\n\n0458-250-0121-F\n\n2 Safety Precautions and Working Techniques\n\n2.19 Circular Saw Blade\n\nSuitable for cutting shrubs and trees with a maxi‐ mum stem diameter of 4 cm.\n\nBefore starting the cut, accelerate the engine up to full throttle. Perform cut with uniform pressure.\n\nUse circular saw blades only with a matching limit stop of the correct diameter.\n\nWARNING\n\nTo reduce the risk of blade damage, avoid con‐ tact with stones and the ground. Resharpen the blade properly in good time – dull teeth may result in the blade cracking and shattering and causing serious injury.\n\nWhen felling, maintain a distance of at least two tree lengths from the next felling site.", "28e55f8a-878f-4c47-8561-36042d1f01e6"]
[{"id": null, "metadata": {"doc_id": "191d27f0-11cf-41f0-b31c-c41156621dc0", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "### Summary\n\n#### Risk of Kickout\n- **High Risk Areas**: The black area of the circular saw blade should not be used for cutting due to the highest risk of kickout.\n- **Moderate Risk Areas**: Lighter shaded areas should only be used by experienced operators with specialized training.\n- **Recommended Area**: Use the non-shaded area of the blade to start cuts, as recommended by STIHL.\n\n#### Approved Combinations of Cutting Attachments\n- **Safety Note**: Only combine cutting attachments, deflectors, handles, and harnesses within the same line of the table to avoid accidents.\n- **Permissible Combinations**: Lists various STIHL cutting attachments such as AutoCut, TrimCut, DuroCut, and PolyCut, along with specific grass cutting blades and circular saw blades.\n- **Metal Cutting Tools**: Includes specific grass cutting blades and brush knives, with a warning against using non-metal materials for these tools. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "2.19.1 Risk of kickout\n\n002BA068 KN\n\n0458-250-0121-F\n\nEnglish\n\nThe risk of kickout is highest in the black area of the blade: Do not use this area of the circular saw blade for cutting.\n\nThere is also a risk of kickout when using the lighter shaded areas of the blade: These areas of the blade should only be used by experienced operators with specialized training.\n\nSTIHL recommends that you use the non-sha‐ ded area of the circular saw blade. Always start the cut with this area of the blade.\n\n11\n\nEnglish\n\n3 Approved Combinations of Cutting Attachment, Deflector, Handle an…\n\nApproved Combinations of Cutting Attachment, Deflector, Han‐ dle and Harness\n\n3\n\nCutting attachment\n\nDeflector, limit stop\n\nHandle\n\nCarrying strap\n\n1 J 2 ‘Z oe) aa ID ‘2 a3 Ga) 27 26 26 29 angele, 28 @\n\n3.1 Permissible combinations\n\n4 STIHL AutoCut 36‑2\n\nChoose the correct combination from the table depending on the cutting tool!\n\nWARNING\n\nFor safety reasons only the cutting attachments, deflector, handle and harness versions within one line of the table may be combined with one another. No other combinations are permitted because of the risk of accidents!\n\n5 STIHL TrimCut 31‑2 6 STIHL TrimCut 32‑21) 7 STIHL DuroCut 20‑2\n\nCON\n\n8 STIHL PolyCut 18‑2\n\n9 STIHL PolyCut 28‑2\n\n3.2.2 Metal cutting tools\n\n3.2 Cutting attachments\n\n10 Grass cutting blade 230‑2 (230 mm dia.)\n\n3.2.1 Mowing heads\n\n1 STIHL SuperCut 20‑2\n\n11 Grass cutting blade 260‑2 (260 mm dia.)\n\n2 STIHL AutoCut 25‑2 / AutoCut 27-2\n\n3 STIHL AutoCut C 26‑2\n\n12 Grass cutting blade 230‑4 (230 mm dia.)\n\n13 Grass cutting blade 230‑8\n\n1) Not approved for FS 250, 250 R\n\n12\n\n0458-250-0121-F\n\n4 Approved Power Tool Attachments\n\n(230 mm dia.)\n\n14 Grass cutting blade 250‑40 Spezial (250 mm dia.)\n\n15 Brush knife 250‑3 (250 mm dia.)\n\n16 Circular saw blade 200 scratcher tooth (Ø 200 mm)\n\n17 Circular saw blade 200-22 chisel tooth (4112), circular saw blade 200-22 HP chisel tooth (4001)\n\nWARNING\n\nGrass cutting blades, brush knives and circular saw blades of other, non-metal materials must not be used.", "191d27f0-11cf-41f0-b31c-c41156621dc0"]
[{"id": null, "metadata": {"doc_id": "87ca432d-e0b3-4944-9a0f-21690de64d27", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text appears to be an excerpt from a user manual for a STIHL power tool, detailing various components and their assembly instructions. Here's a concise summary:\n\n### Components and Attachments:\n- **Deflectors and Limit Stops:**\n  - Various deflectors for mowing heads and metal cutting attachments.\n  - Limit stop for circular saw blades.\n\n- **Handles:**\n  - Different types of handles including loop handle, loop handle with barrier bar, and bike handle.\n\n- **Shoulder Straps:**\n  - Options for shoulder straps and full harnesses, with some being mandatory.\n\n### Approved Attachments:\n- Specific STIHL attachment (Interchangeable Attachment BF) for pick tines.\n\n### Assembly Instructions:\n- **Mounting the Bike Handle:**\n  - Detailed steps for positioning and fastening the handlebar and control handle.\n  - Instructions for aligning and tightening screws.\n\n- **Mounting the Control Handle:**\n  - Steps to attach the control handle to the handlebar, ensuring proper alignment and tightening.\n\n- **Fastening the Throttle Cable:**\n  - Guidelines to avoid kinking the throttle cable and ensuring free movement of the throttle trigger.\n  - Instructions for positioning and securing the throttle cable retainer.\n\nThis summary captures the key components and assembly instructions provided in the text. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "3.3 Deflectors, limit stop\n\n18 Deflector for mowing heads\n\n19 Deflector with\n\n20 Skirt and blade for mowing heads\n\n21 Deflector without skirt and blade for metal cut‐ ting attachments, items 9 to 14\n\n22 Limit stop for circular saw blades\n\n3.4 Handle\n\n23 Loop handle\n\n24 Loop handle with\n\n25 Barrier bar\n\n26 Bike handle\n\n3.5 Shoulder straps\n\n27 Shoulder strap must be used\n\n28 Full harness can be used\n\n29 Full harness must be used\n\nApproved Power Tool Attachments\n\n4\n\nThe following STIHL attachment may be moun‐ ted to the basic power tool:\n\n0458-250-0121-F\n\nEnglish\n\nzg\n\nInterchangeable Attachment BF\n\nApplication\n\nPick tines\n\n5 Mounting the Bike Handle Mounting the Handlebar 5.1\n\n0208BA075 KN\n\nDo not rotate the control handle between unpacking and mounting it on the handlebar; see also chapter on \"Adjusting the Throttle Cable\".\n\n13\n\nEnglish\n\n0208BA009 KN\n\n► Fasten the handlebar (1) at a distance (A) of approx. 40 cm (15 in) ahead of the engine housing on the shaft (2)\n\n► Position the clamp (3) and handle support (4) on the sleeve (5) on the drive tube (2)\n\n6 ma 0000-GXX-1239-A1\n\n► Place handlebar (1) in the handlebar support so that the distance (B) is not more than 15 cm (6 in) – the rubber handle (6) must be\n\n14\n\n5 Mounting the Bike Handle\n\non the left (viewing direction from engine to handlebar)\n\n► Place the clamp (7) on the handlebar support ► Insert the screws (8) through the holes in the\n\nparts and screw them into the clamp (3) as far as they will go\n\n► Align the handlebar ► Tighten the screws\n\n5.2 Mounting the Control Handle\n\n250BA077 KN\n\n► Unscrew the screw (1) – the nut (2) remains in the control handle (3)\n\n► Push the control handle with the throttle trig‐ ger (4) facing toward the gearbox onto the end of the handlebar (5) until the holes (6) align\n\n► Insert and tighten screw (1)\n\n0458-250-0121-F\n\n6 Mounting the Loop Handle\n\n5.3 Fastening the Throttle Cable\n\nNOTICE\n\nDo not kink the throttle cable or lay it in tight radii – make sure the throttle trigger moves freely.\n\n{| 0000-GXX-1240-A1\n\n► Position the throttle cable retainer (2) and the throttle cable (1) on the shaft\n\n► Squeeze the throttle cable retainer (2). The throttle cable retainer (2) engages in position with an audible click\n\n5.4 ► Check adjustment of throttle cable – see chap‐\n\nter on \"Adjusting the Throttle Cable\".\n\n0458-250-0121-F\n\nEnglish", "87ca432d-e0b3-4944-9a0f-21690de64d27"]
[{"id": null, "metadata": {"doc_id": "87bd7033-729d-4532-a1f5-666fbac5d94a", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text outlines the steps for mounting and securing a loop handle on a piece of equipment, with and without a barrier bar, and includes instructions for adjusting the throttle cable and fitting a carrying ring.\n\n1. **Mounting the Loop Handle with Barrier Bar:**\n   - Fit square nuts into the barrier bar.\n   - Position the clamp in the loop handle and place them against the drive tube.\n   - Align the holes and insert screws into the barrier bar.\n   - Proceed to secure the loop handle.\n\n2. **Mounting the Loop Handle without Barrier Bar:**\n   - Position the clamp in the loop handle and place them against the drive tube.\n   - Align the holes, fit washers on the screws, and insert them.\n   - Fit square nuts and screw them down.\n   - Proceed to secure the loop handle.\n\n3. **Securing the Loop Handle:**\n   - Adjust the loop handle to suit the operator's height and reach.\n   - Recommended distance: about 20 cm (8 in).\n   - Tighten screws until the handle is secure.\n   - Ensure the sleeve is between the loop handle and control handle if applicable.\n\n4. **Adjusting the Throttle Cable:**\n   - Ensure the machine is fully assembled.\n   - Push the slide to the end of the slot.\n   - Press down the trigger lockout and squeeze the throttle trigger to set the throttle cable correctly.\n\n5. **Fitting the Carrying Ring:**\n   - Use a suitable tool to push the slide to the end of the slot.\n   - Press down the trigger lockout and squeeze the throttle trigger to set the throttle cable correctly. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "6 Mounting the Loop Handle 6.1\n\nMounting Loop Handle with Barrier Bar\n\n2M ||\n\n► Fit the square nuts (1) in the barrier bar (2); the holes must line up.\n\n002BA099 KN\n\n► Place the clamp (3) in the loop handle (4) and position them both against the drive tube (5).\n\n15\n\nEnglish\n\n► Position the clamp (6) against the drive tube. ► Place the barrier bar (2) in position as shown. ► Line up the holes. ► Insert the screws (7) in the holes and screw them into the barrier bar (2) as far as stop.\n\n► Go to \"Securing the Loop Handle\".\n\n6.2 Mounting the Loop Handle without Barrier Bar\n\nS 002BA614 KN\n\n► Place the clamp (3) in the loop handle (4) and position them both against the drive tube (5). ► Position the clamp (6) against the drive tube. ► Line up the holes. ► Fit washers (8) on the screws (7) and insert\n\nthe screws in the holes. Fit the square nuts (1) and screw them down as far as stop.\n\n► Go to \"Securing the Loop Handle\".\n\n16\n\n7 Adjusting the Throttle Cable\n\n6.3 Securing the Loop Handle\n\nZz & ry & < a g s 8\n\nThe loop handle can be adjusted to suit the height and reach of the operator and the applica‐ tion by changing distance (A).\n\nRecommendation: distance (A): about 20 cm (8 in) ► Slide the handle to the required position. ► Line up the loop handle (4). ► Tighten down the screws until the loop handle can no longer be rotated on the drive tube. If no barrier bar is fitted – lock the nuts if neces‐ sary.\n\nThe sleeve (9) (not fitted on all models) must be between the loop handle and the control handle.\n\n7 Adjusting the Throttle Cable\n\n7.1 Loop Handle\n\nA properly adjusted throttle cable is the precondi‐ tion for correct operation in the starting throttle, idle and full throttle positions.\n\nAdjust the throttle cable only when the machine is completely and properly assembled.\n\n0458-250-0121-F\n\n8 Fitting the Carrying Ring\n\nEe | w) 002BA163 KN\n\n► Use a suitable tool to push the slide to the end of the slot (see illustration).\n\n2 002BA161 KN\n\n► Press down the trigger lockout (1) and squeeze the throttle trigger (2) (full throttle position) – this sets the throttle cable correctly.", "87bd7033-729d-4532-a1f5-666fbac5d94a"]
[{"id": null, "metadata": {"doc_id": "bc671e67-d595-40c6-a6fc-c6547bf22554", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions for assembling and adjusting various components of a bike handle and related parts. Key points include:\n\n1. **Throttle Cable Adjustment**: Instructions for adjusting the throttle cable after assembly or prolonged use, ensuring the machine is fully assembled before making adjustments.\n\n2. **Fitting the Carrying Ring**: Steps to attach the carrying ring to the drive tube, including inserting an M5 nut and screw, aligning, and tightening the ring.\n\n3. **Mounting the Deflector**: Guidelines for attaching deflectors for mowing attachments and heads to the gearbox, including inserting and tightening screws.\n\n4. **Fitting and Removing the Skirt**: Instructions for attaching and detaching the skirt to/from the deflector, ensuring it snaps into position or is removed using a stop pin.\n\n5. **Mounting the Blade**: Steps to attach the line limiting blade to the skirt, including sliding it into the guide and securing it with a screw.\n\n6. **Mounting the Limit Stop**: Instructions for attaching the limit stop to the gearbox flange when using a circular saw blade, emphasizing the importance of securing it to prevent injury from thrown objects. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "7.2 Bike Handle\n\nIt may be necessary to correct the adjustment of the throttle cable after assembling the machine or after a prolonged period of operation.\n\nRQ 002BA655 KN\n\nAdjust the throttle cable only when the machine is completely and properly assembled. ► Set the throttle trigger to the full throttle posi‐\n\ntion.\n\n► Carefully rotate the screw in the throttle trigger in the direction of the arrow until you feel initial resistance. Then rotate it another half turn in the same direction.\n\n0458-250-0121-F\n\nEnglish\n\nFitting the Carrying Ring\n\n8 8.1\n\nPolymer Version\n\n002BA529 KN\n\nFor position of carrying ring see \"Main Parts\". ► Push the carrying ring (1) over the drive tube. ► Insert the M5 nut in the hex recess in the car‐\n\nrying ring.\n\n► Fit the M5x14 screw. ► Line up the carrying ring. ► Tighten down the screw firmly.\n\n17\n\nEnglish\n\n9 Mounting the deflector 9.1\n\n002BA636 KN\n\n1 Deflector for mowing attachments\n\n2 Deflector for mowing heads\n\nDeflectors (1 and 2) are both mounted to the gearbox in the same way. ► Place the deflector on the gearbox flange. ► Insert the screws (3) and tighten them down\n\nfirmly.\n\n18\n\n9 Mounting the deflector\n\n9.2 Fitting the Skirt and Blade\n\nWARNING\n\nRisk of injury from thrown objects and contact with the cutting attachment. These parts must be fitted to the deflector (1) when you use a mowing head.\n\n9.3 Fitting the Skirt\n\n002BA637 KN\n\n► Slide the lower guide slot of the skirt onto the deflector – it must snap into position.\n\n9.4 Removing the Skirt\n\n002BA646 KN\n\n► Insert the stop pin into the hole in the skirt and use it to push the skirt to the left.\n\n► Pull the skirt off the deflector.\n\n9.5 Mounting the Blade\n\n002BA638 KN\n\n► Slide the line limiting blade into the guide on the skirt.\n\n► Insert the screw and tighten it down firmly.\n\n0458-250-0121-F\n\n10 Mounting the Cutting Attachment\n\n9.6 Mounting the Limit Stop\n\nWARNING \n\nRisk of injury from thrown objects and contact with the cutting attachment. Always fit the limit stop (6) when you use a circular saw blade.\n\n► Position the limit stop (6) on the gearbox flange.\n\n► Insert the screws (7) and tighten them down firmly.", "bc671e67-d595-40c6-a6fc-c6547bf22554"]
[{"id": null, "metadata": {"doc_id": "478845dd-291d-401c-809c-7bdc1a93564c", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions for mounting a cutting attachment on a power tool. It includes the following steps:\n\n1. **Placing the Power Tool on the Ground**: Shut off the engine and lay the tool on its back with the mounting face up.\n2. **Mounting Hardware for Cutting Attachments**: The hardware varies depending on the attachment. Machines may come with or without mounting hardware.\n   - **With Mounting Hardware**: May include a nut, rider plate, and thrust washer.\n   - **Without Mounting Hardware**: Only mowing heads that mount directly to the shaft can be used.\n3. **Blocking the Shaft**: Use a stop pin or screwdriver to block the output shaft for mounting or removing attachments.\n4. **Removing the Mounting Hardware**: Block the shaft and use a combination wrench to remove the nut and thrust washer.\n5. **Mounting the Cutting Attachment**: Ensure the deflector matches the attachment. Fit the thrust plate and turn the mowing head anticlockwise on the shaft.\n\nWarnings and specific tool parts are mentioned to ensure proper and safe assembly. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "10 Mounting the Cutting Attachment\n\n10.1 Placing power tool on the ground\n\n002BA104 KN 2+\n\n► Shut off the engine. ► Lay your power tool on its back so that the cut‐ ting attachment mounting face is pointing up.\n\n10.2 Mounting Hardware for Cutting Attachments\n\nThe mounting hardware supplied depends on the cutting attachment that comes as original equip‐ ment with the new machine.\n\n10.2.1 Machine supplied with mounting hard‐ ware\n\nMowing heads and metal cutting attachments may be mounted.\n\n0458-250-0121-F\n\nEnglish\n\n002BA164 KN\n\nDepending on the cutting attachment, it may be necessary to use the nut (3), rider plate (4) and thrust washer (5).\n\nThese parts are included in a kit supplied with the machine and are also available as special accessories.\n\n10.2.2 ► Pull the hose (1) off the shaft (2).\n\nlock\n\n10.2.3 Machine supplied without mounting hardware\n\n002BA266 KN\n\nOnly mowing heads may be used which mount directly to the shaft (2).\n\n19\n\nEnglish\n\n10.3 Blocking the Shaft\n\n6 002BA330 KN\n\nThe output shaft (2) must be blocked with the stop pin (6) or screwdriver (6) to mount or remove cutting attachments. These parts come standard with the machine or are available as special accessories. ► Insert the stop pin (6) or screwdriver (6) in the hole (7) in the gearbox as far as stop – and apply slight pressure.\n\n► Rotate shaft, nut or cutting attachment until the stop pin slips into position and blocks the shaft.\n\nRemoving the Mounting Hard‐ ware\n\n10.4\n\n271BA057 KN\n\n► Block the shaft. ► Use the combination wrench (1) to loosen and\n\nremove the nut (2) clockwise (left-hand thread).\n\n20\n\n10 Mounting the Cutting Attachment\n\n► Take the thrust washer (3) off the shaft (4). Do not remove the thrust plate (5).\n\n10.5 Mounting the Cutting Attach‐ ment\n\nWARNING\n\nUse a deflector that matches the cutting attach‐ ment – see \"Mounting the Deflector\".\n\nFitting the mowing head with screw mounting\n\n10.6\n\nKeep the supplement sheet for the mowing head in a safe place.\n\n002BA385 KN\n\n► Fit the thrust plate ► Turn the mowing head anticlockwise on the\n\nshaft (1) as far as it will go", "478845dd-291d-401c-809c-7bdc1a93564c"]
[{"id": null, "metadata": {"doc_id": "e77ff99e-bc11-4611-99ac-3360bc90b3e7", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions for mounting and removing mowing and cutting attachments on a tool, likely a trimmer or similar device. Key points include:\n\n1. **Removing the Mowing Head**: Retain the shaft and turn the mowing head clockwise.\n2. **Mounting Metal Cutting Attachments**: \n   - Keep the leaflet and packaging.\n   - Wear protective gloves.\n   - Mount only one metal cutting attachment.\n   - Check the direction of rotation, indicated by an arrow on the deflector.\n   - Specific cutting attachments need to be turned regularly to avoid one-sided wear.\n3. **Securing the Cutting Attachment**:\n   - Place the cutting attachment on the thrust plate.\n   - Ensure the collar engages the mounting hole.\n   - Fit the thrust washer (convex side up), rider plate, and block the shaft.\n   - Use a combination wrench to screw the mounting nut counterclockwise and tighten it firmly.\n   - Replace the mounting nut if it becomes too loose.\n\nWarnings emphasize the importance of wearing protective gloves and ensuring the correct direction of rotation to avoid accidents. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "► Retain the shaft ► Tighten the mowing head\n\nNOTICE\n\nRemove the tool that was used to block the shaft.\n\nRemoving the Mowing Head\n\n10.7 ► Retain the shaft ► Turn the mowing head clockwise\n\n0458-250-0121-F\n\n10 Mounting the Cutting Attachment\n\n10.8 Mounting Metal Cutting Attach‐ ments\n\nKeep the leaflet and packaging of the metal cut‐ ting attachment in a safe place.\n\nWARNING\n\nWear protective gloves to reduce the risk of direct contact with the sharp cutting edges.\n\nMount only one metal cutting attachment.\n\nCheck direction of rotation of cutting attachment\n\n4 5 6 7 681BA042 KN\n\nCutting attachments 2, 4 and 5 may be mounted either way round – they must be turned over reg‐ ularly to help avoid one-sided wear.\n\nThe cutting edges of cutting attachments 1, 3, 6 and 7 must point clockwise.\n\n0458-250-0121-F\n\nEnglish\n\nWARNING\n\nDirection of rotation is indicated by an arrow on the inside of the deflector.\n\n681BA161 KN Az\n\n► Place the cutting attachment (8) on the thrust plate (9).\n\nWARNING\n\nCollar (see arrow) must engage the cutting attachment's mounting hole.\n\nSecuring the cutting attachment ► Fit the thrust washer (10) – convex side must\n\nface up.\n\n► Fit the rider plate (11). ► Block the shaft (12). ► Use the combination wrench (14) to screw the mounting nut (13) on to the output shaft coun‐ terclockwise and tighten it down firmly.\n\n21\n\nEnglish\n\nWARNING\n\nIf the mounting nut has become too loose, fit a new one.", "e77ff99e-bc11-4611-99ac-3360bc90b3e7"]
[{"id": null, "metadata": {"doc_id": "2662b6b5-066b-47b6-852a-ee75244a60b9", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text is an instruction manual for handling and maintaining a piece of equipment, likely a power tool with a metal cutting attachment. Here is a concise summary:\n\n1. **Removing the Metal Cutting Attachment**:\n   - Wear protective gloves to avoid contact with sharp edges.\n   - Block the shaft and unscrew the mounting nut clockwise.\n   - Remove the cutting attachment and its hardware, but leave the thrust plate in place.\n\n2. **Fuel Requirements**:\n   - The engine needs a mix of gasoline and engine oil.\n   - Use STIHL MotoMix for optimal performance, which is pre-blended and high-octane but not available everywhere.\n   - If mixing fuel yourself, use high-quality gasoline (at least 90 ROC) and STIHL two-stroke engine oil or equivalent.\n   - Avoid gasoline with more than 10% alcohol for engines with manually adjustable carburetors; M-Tronic engines can handle up to 27% alcohol.\n   - The recommended mixing ratio is 1 part oil to 50 parts gasoline.\n\nWarnings are provided to avoid direct skin contact with fuel and to prevent engine damage from unsuitable fuels or incorrect mixing ratios. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Remove the tool used to block the shaft.\n\n10.9 Removing the Metal Cutting Attachment\n\nWARNING\n\nA\n\nWear protective gloves to reduce the risk of direct contact with the sharp cutting edges.\n\n► Block the shaft. ► Unscrew the mounting nut clockwise. ► Remove cutting attachment and its mounting\n\nhardware from the gearbox – but do not remove the thrust plate (9).\n\n11 Fuel The engine requires a mixture of gasoline and engine oil.\n\nWARNING\n\nA\n\nAvoid direct skin contact with fuel and breathing in of gasoline fumes.\n\n11.1 STIHL MotoMix\n\nSTIHL recommends using STIHL MotoMix. This pre-blended fuel is free of benzene and lead, is distinguished by a high octane rating, and always provides the proper mixing ratio.\n\nSTIHL MotoMix uses STIHL HP Ultra two-stroke engine oil for optimum engine life.\n\nMotoMix is not available in all markets.\n\n11.2 Mixing fuel\n\n|\n\nNOTICE\n\nUnsuitable fuels or a mixing ratio that deviates from the specification can lead to severe engine damage. The engine, seals, fuel lines and fuel tank may be damaged if low-quality gasoline or engine oil is used.\n\n11.2.1 Gasoline\n\nUse only high-quality gasoline with an octane rat‐ ing of at least 90 ROC – leaded or unleaded.\n\n22\n\n11 Fuel\n\nGasoline with an alcohol component exceeding 10% can cause impaired engine performance in engines with manually adjustable carburetors and thus should not be used in these engines.\n\nEngines with M-Tronic deliver full engine per‐ formance using gasoline with an alcohol compo‐ nent of up to 27% (E27).\n\n11.2.2 Engine oil\n\nIf you mix the fuel yourself, use only STIHL two- stroke engine oil or another high-performance engine oil classified as JASO FB, JASO FC, JASO FD, ISO-L-EGB, ISO-L-EGC or ISO-L- EGD.\n\nSTIHL specifies STIHL HP Ultra two-stroke engine oil or an equivalent high-performance engine oil in order to maintain emission limits over the machine’s service life.\n\n11.2.3 Mixing ratio\n\nwith STIHL two-stroke engine oil 1:50; 1:50 = 1 part oil + 50 parts gasoline\n\n11.2.4 Examples", "2662b6b5-066b-47b6-852a-ee75244a60b9"]
[{"id": null, "metadata": {"doc_id": "696728a1-68d8-47f3-b750-68b67f4854e8", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text and table offer detailed instructions on handling and storing fuel mixtures for STIHL two-stroke engines. \n\n**Summary:**\n\n1. **Fuel Mixture Preparation:**\n   - Mix STIHL two-stroke engine oil with gasoline in a 1:50 ratio.\n   - Quantities for mixing range from 1 liter to 25 liters of gasoline, with corresponding oil amounts provided in milliliters.\n\n2. **Storing Fuel Mixture:**\n   - Use approved safety fuel canisters.\n   - Store in a dry, cool, and secure place, protected from light and sunlight.\n   - Mix only enough fuel for a few weeks; do not store for more than 30 days.\n   - STIHL MotoMix can be stored for up to 5 years.\n   - Shake the canister thoroughly before refueling.\n\n3. **Fueling:**\n   - Open the canister carefully to avoid pressure build-up.\n   - Clean the fuel tank and canister periodically.\n   - Clean the filler cap and surrounding area before fueling.\n   - Position the machine with the tank cap facing up.\n   - Avoid spilling fuel and do not overfill the tank.\n   - Use the STIHL filler nozzle for fuel if available.\n   - Tighten the tank cap securely after fueling.\n\n4. **Fitting the Harness:**\n   - The type of harness/shoulder strap varies by market.\n   - Instructions for using the shoulder strap are provided.\n   - Adjust the strap length so the carabiner is about a hand’s width below the right hip.\n   - Balance the machine as described in the manual.\n\nThese guidelines ensure safe and efficient handling, storage, and usage of fuel mixtures for STIHL equipment. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Quantity of gaso‐ line Liters 1 5 10 15 20 25 ► Pour oil into an approved safety fuel canister first, then add gasoline and mix thoroughly\n\nSTIHL two-stroke engine oil 1:50 (ml) Liters (20) 0.02 (100) 0.10 (200) 0.20 (300) 0.30 (400) 0.40 (500) 0.50\n\n11.3 Storing fuel mixture\n\nStore in approved safety fuel canisters only in a dry, cool and secure place protected against light and sunlight.\n\nFuel mixture deteriorates with age – mix only as much as needed for a few weeks. Do not store fuel mixture for longer than 30 days. The fuel mixture can become unusable more quickly if exposed to light, sunlight or low or high tempera‐ tures.\n\nSTIHL MotoMix however can be stored for up to 5 years without any problems. ► Shake the canister containing the fuel mixture\n\nthoroughly before refueling\n\n0458-250-0121-F\n\n12 Fueling\n\nWARNING\n\nPressure may have built up in the canister – open it carefully.\n\n► The fuel tank and the canister in which fuel mixture is stored should be cleaned thoroughly from time to time\n\nResidual fuel and the liquid used for cleaning must be disposed of in accordance with regula‐ tions and without harming the environment!\n\n12 Fueling\n\nme\n\n12.1 Preparations\n\n— O ax As I O 256BA060 KN\n\n► Before fueling, clean the filler cap and the area around it to ensure that no dirt falls into the tank.\n\n► Position the machine so that the tank cap faces up.\n\n12.2 Filling Up with Fuel\n\nTake care not to spill fuel while fueling and do not overfill the tank. STIHL recommends you use the STIHL filler nozzle for fuel (special acces‐ sory). ► Open the tank cap. ► Fill up with fuel.\n\n0458-250-0121-F\n\nEnglish\n\n► Closing the Tank Cap\n\nWARNING\n\nAfter fueling, tighten down the filler cap as securely as possible by hand.\n\n13 Fitting the Harness The type and style of the harness/shoulder strap depend on the market.\n\nThe use of the shoulder strap is described in the chapter on \"Approved Combinations of Cutting Attachment, Deflector, Handle and Harness\".\n\n13.1 Shoulder Strap\n\n002BA441 KN\n\n► Put on the shoulder strap (1). ► Adjust the length of the strap so that the cara‐ biner (2) is about a hand’s width below your right hip.\n\n► Balance the machine – see \"Balancing the Machine\".\n\n23\n\nEnglish", "696728a1-68d8-47f3-b750-68b67f4854e8"]
[{"id": null, "metadata": {"doc_id": "bfa6e63f-5dde-4891-b455-834f6edbfb2f", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions on how to properly use and adjust a full harness for operating a machine. Key points include:\n\n1. **Putting on the Harness**: Wear the harness and close the locking plate. Adjust the strap length so the carabiner is about a hand's width below the right hip.\n2. **Attaching the Machine**: Attach the carabiner to the carrying ring on the drive tube.\n3. **Disconnecting the Machine**: Press down the bar on the carabiner and pull the carrying ring out.\n4. **Emergency Procedures**: Practice quickly removing the machine in case of danger. For shoulder straps, practice slipping it off the shoulder. For full harnesses, practice opening the locking plate and slipping off the straps.\n5. **Balancing the Machine**: Adjust the carrying ring along the drive tube to achieve the correct floating position. Mowing tools should just touch the ground, while circular saw blades should hover about 20 cm above the ground. Tighten the screw once the correct position is achieved. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "13.2 Full Harness\n\n002BA228 KN\n\n► Put on the harness (1) and close the locking plate (3).\n\n► Adjust the length of the strap – with the\n\nmachine attached, the carabiner (2) must be about a hand's width below your right hip. ► Balance the machine – see \"Balancing the\n\nMachine\".\n\n24\n\n13 Fitting the Harness\n\n13.3 Attaching Machine to Harness\n\n002BA660 KN\n\nThe type and style of the harness and carabiner (spring hook) depend on the market. ► Attach the carabiner (1) to the carrying ring (2)\n\non the drive tube.\n\n0458-250-0121-F\n\n14 Balancing the Machine\n\n13.4 Disconnecting Machine from Harness\n\n002BA661 KN\n\n► Press down the bar on the carabiner (1) and pull the carrying ring (2) out of the carabiner.\n\n13.5 Throwing Off the Machine\n\nWARNING\n\nThe machine must be quickly thrown off in the event of imminent danger. Practice removing and putting down the machine as you would in an emergency. To avoid damage, do not throw the unit to the ground when practicing.\n\nPractice quickly detaching the power tool from the carabiner as described under \"Disconnecting Machine from Harness\".\n\nIf you are using a shoulder strap: Practice slip‐ ping the strap off your shoulder.\n\nIf you are using a full harness: Practice quickly opening the locking plate and slipping the har‐ ness straps off your shoulders.\n\n14 Balancing the Machine 14.1\n\nThe unit is balanced differently depending on the cutting attachment used.\n\nProceed as follows until the conditions specified under \"Floating positions\" have been met:\n\n0458-250-0121-F\n\nEnglish\n\n002BA662 KN\n\n► Loosen the screw (1). ► Slide the carrying ring (2) along the drive tube. ► Tighten the screw moderately. ► Allow the unit to hang freely. ► Check the position obtained.\n\nBalanced positions\n\n002BA388 KN\n\nMowing tools such as mowing heads, grass cut‐ ting blades and brush knives ► should just touch the ground.\n\n25\n\nEnglish\n\n— ; E t [\n\nCircular saw blades ► should \"hover\" about 20 cm (8 in) above the\n\nground.\n\nWhen the correct floating position has been reached: ► Tighten down the screw on the carrying ring\n\nfirmly.", "bfa6e63f-5dde-4891-b455-834f6edbfb2f"]
[{"id": null, "metadata": {"doc_id": "571d5b51-7b71-4730-980d-9aa5894ce3dd", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text outlines the procedures for starting and stopping an engine, detailing the controls and steps involved:\n\n1. **Control Handles**:\n   - **Handlebar**: Includes a start button, throttle trigger lockout, throttle trigger, and slide control.\n   - **Drive Tube**: Similar controls as the handlebar.\n\n2. **Slide Control Positions**:\n   - **STOP-0**: Engine off, ignition off.\n   - **F**: Normal run position, engine running or ready to start.\n   - **START**: Ignition on, engine ready to start.\n\n3. **Slide Control Symbol**:\n   - **h**: Stop symbol with an arrow indicating the direction to stop the engine.\n\n4. **Starting Procedure**:\n   - Press and hold the throttle trigger lockout and throttle trigger.\n   - Move the slide control to START, then release the controls in sequence.\n   - Set the choke knob based on engine temperature (cold or warm start).\n   - Press the manual fuel pump bulb at least five times.\n\n5. **Cranking**:\n   - Place the unit securely on the ground.\n   - Ensure the cutting attachment is clear of obstacles.\n   - Hold the unit firmly, avoiding the throttle trigger, lockout lever, or slide control.\n   - Pull the starter grip with a strong, brisk motion.\n\n**Notice**: Do not stand or kneel on the drive tube. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "15 Starting / Stopping the Engine\n\n15.1 Controls\n\n15.1.1 Control handle on handlebar\n\n0 I START | 45 6 \\lg 9 71S\n\n1 Throttle trigger lockout\n\n2 Throttle trigger\n\n3 Slide control\n\n26\n\n002BA668 KN\n\n15 Starting / Stopping the Engine\n\n15.1.2 Control handle on drive tube\n\n002BA181 KN\n\n1 Throttle trigger lockout\n\n2 Throttle trigger\n\n3 Slide control\n\n15.1.3 Positions of slide control\n\n4 STOP-0 – engine off – ignition is switched off 5 F – normal run position – the engine is running\n\nor can start\n\n6 START – ignition is switched on – the engine can start\n\n15.1.4 Symbol on slide control\n\n7 h – stop symbol and arrow. To stop the engine, push the slide control in the direction of the arrow on the stop symbol (h) to STOP-0.\n\n15.2 ► Press down the trigger lockout lever and\n\n> Press down the trigger lockout lever and squeeze the throttle trigger\n\nsqueeze the throttle trigger ► and hold them in that position. ► Move the slide control to START and hold it\n\nthere.\n\n► Now release the throttle trigger, slide control and trigger lockout lever in that order. This is the starting throttle position.\n\n0458-250-0121-F\n\n15 Starting / Stopping the Engine\n\n7 fee) 250BA018 KN [ror\n\n► Set the choke knob (8) to:\n\ng if the engine is cold e for warm start – also use this position if the\n\n= for warm start - also use this position if the engine has been running but is still cold.\n\nengine has been running but is still cold. ► Press the manual fuel pump bulb (9) at least five times – even if the bulb is filled with fuel.\n\n15.2.1 Cranking\n\nNw na ta — bey We 002BA038 KN\n\n002BA040 KN\n\n► Place the unit on the ground: It must rest securely on the engine support and the deflec‐ tor.\n\n► If fitted: Remove the transport guard from the cutting attachment.\n\nTo reduce the risk of accidents, check that the cutting attachment is not touching the ground of any other obstacles. ► Make sure you have a firm footing, either\n\nstanding, stooping or kneeling.\n\n► Hold the unit firmly on the ground with your left hand and press down – do not touch the throt‐ tle trigger, lockout lever or slide control.\n\n0458-250-0121-F\n\nEnglish\n\nNOTICE \n\nDo not stand or kneel on the drive tube.\n\nf 002BA072 KN\n\n► Hold the starter grip with your right hand. ► Pull the starter grip slowly until you feel it\n\nengage and then give it a brisk strong pull.", "571d5b51-7b71-4730-980d-9aa5894ce3dd"]
[{"id": null, "metadata": {"doc_id": "1663c062-ee91-49ab-ad70-51d6f7944f49", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions for starting, operating, and troubleshooting an engine. Key points include:\n\n1. **Starting the Engine**: \n   - Do not pull the starter rope all the way out.\n   - Guide the starter grip back slowly.\n   - Continue cranking until the engine begins to fire.\n   - Turn the choke knob to position \"e\" and continue cranking until the engine runs.\n   - Blip the throttle trigger to move the slide control to the normal run position \"F\".\n\n2. **Operating the Engine**:\n   - Ensure the carburetor is correctly adjusted so the cutting attachment does not rotate at idle.\n   - For very low temperatures, warm up the engine by opening the throttle slightly.\n\n3. **Stopping the Engine**:\n   - Push the slide control towards the stop symbol (h) to STOP-0.\n\n4. **Troubleshooting**:\n   - If the engine does not start, ensure the choke knob is in the correct position and the combustion chamber is not flooded.\n   - If flooded, dry the spark plug, open the throttle wide, and crank the engine to clear the chamber.\n   - Check and adjust the throttle cable if necessary. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "NOTICE\n\nDo not pull out the starter rope all the way – it might otherwise break.\n\n► Do not let the starter grip snap back. Guide it slowly back into the housing so that the starter rope can rewind properly.\n\n► Continue cranking.\n\n15.2.2 When engine begins to fire ► Turn the choke knob to e. ► Continue cranking until the engine runs.\n\nAs soon as the engine runs 15.2.3 ► Blip the throttle trigger immediately. The slide control moves to the normal run position F – and the engine settles down to idle speed.\n\nWARNING\n\nMake sure the carburetor is correctly adjusted. The cutting attachment must not rotate when the engine is idling.\n\nYour machine is now ready for operation.\n\n15.3 Stopping the Engine ► Push the slide control in the direction of the arrow on the stop symbol (h) to STOP-0.\n\n15.4 At very low outside tempera‐ tures\n\nAs soon as the engine runs: ► Blip the throttle trigger to disengage the start‐\n\ning throttle position. The slide control moves to the normal run position F – and the engine set‐ tles down to idle speed.\n\n27\n\nEnglish\n\n► Open the throttle slightly. ► Warm up the engine for a short period.\n\n15.5 If the engine does not start\n\n15.5.1 Choke knob\n\nIf you did not turn the choke knob to e quickly enough after the engine began to fire, the com‐ bustion chamber is flooded. ► Turn the choke knob to e. ► Select the starting throttle position. ► Start the engine by pulling the starter rope briskly – 10 to 20 pulls may be necessary.\n\nIf the engine still does not start ► Push the slide control in the direction of the arrow on the stop symbol (h) to STOP-0. ► Remove the spark plug – see \"Spark Plug\". ► Dry the spark plug. ► Open the throttle wide. ► Crank the engine several times with the starter\n\nto clear the combustion chamber.\n\n► Refit the spark plug – see \"Spark Plug\". ► Move the slide control to START. ► Set the choke knob to e – even if the engine\n\nis cold.\n\n► Start the engine.\n\n15.5.2 Throttle Cable Adjustment ► Check adjustment of throttle cable – see chap‐\n\nter on \"Adjusting the Throttle Cable\".", "1663c062-ee91-49ab-ad70-51d6f7944f49"]
[{"id": null, "metadata": {"doc_id": "cd9c41bc-e638-4c47-817c-4fa03ae6def3", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "### Summary\n\n#### Fuel Tank Run Dry Procedure\n1. **Refueling Steps**:\n   - Press the manual fuel pump bulb at least five times.\n   - Turn the choke knob to the designated position.\n   - Follow the engine starting procedure for a cold engine.\n\n#### Transporting the Unit\n1. **Transport Guard Types**:\n   - Different guards are available based on the metal cutting attachment.\n   - Specific instructions are provided for:\n     - 230 mm Grass Cutting Blades\n     - 250 mm Brush Knives\n     - Grass Cutting Blades up to 260 mm\n     - Circular Saw Blades\n\n2. **General Steps for Transport Guard**:\n   - Disconnect and swing out the wire rod.\n   - Fit the transport guard from below.\n   - Swing the wire rod into position and hook it to the guard.\n\n#### Operating Instructions\n1. **Break-in Period**:\n   - Avoid high revs for the first three tank fillings.\n   - Maximum engine power is achieved after 5 to 15 tank fillings.\n\n2. **During Operation**:\n   - After full throttle operation, let the engine idle briefly to dissipate heat and protect components. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "15.5.3 Fuel tank run until completely dry\n\nRecommendation: Carry out the following steps irrespective of the engine's operating condition before the tank was run dry. ► After refueling, press the manual fuel pump\n\nbulb at least five times – even if the bulb is fil‐ led with fuel.\n\n► Turn the choke knob to g. ► Go to section on \"Starting\" and re-start the engine as described for a cold engine.\n\n16 Transporting the Unit Using Transport Guard 16.1\n\nThe type of transport guard depends on the metal cutting attachment supplied with the machine. Transport guards are available as spe‐ cial accessories.\n\n28\n\n16 Transporting the Unit\n\n16.2 230 mm Grass Cutting Blades\n\nz z 8 a t 3 8\n\n—> (S53 c a? Ss ©\n\nz g 5 8 Ba ES 5 8\n\n681BA272 KN\n\n0458-250-0121-F\n\n16 Transporting the Unit\n\n16.3 250 mm Brush Knives\n\n681BA268 KN\n\nAl _- 681BA271 KN\n\n681BA272 KN\n\n0458-250-0121-F\n\nEnglish\n\n16.4 Grass Cutting Blades up to 260 mm\n\n681BA301 KN\n\n681BA275 KN\n\n► Disconnect wire rod from the transport guard. ► Swing wire rod outwards.\n\n681BA305 KN\n\n► Fit the transport guard on the cutting attach‐ ment from below.\n\n29\n\nEnglish\n\nZz g\n\n► Swing wire rod into position. ► Hook wire rod to the transport guard.\n\n16.5 Circular Saw Blades\n\nz Fa\n\n681BA275 KN\n\n► Disconnect wire rod from the transport guard.\n\n30\n\n17 Operating Instructions\n\n681BA276 KN\n\n► Swing wire rod outwards. ► Fit transport guard on saw blade from below,\n\nmaking sure the limit stop is properly seated in the recess.\n\n681BA277 KN\n\n► Swing wire rod into position. ► Hook wire rod to the transport guard.\n\n17 Operating Instructions 17.1\n\nA factory-new machine should not be run at high revs (full throttle off load) for the first three tank fillings. This avoids unnecessary high loads dur‐ ing the break-in period. As all moving parts have to bed in during the break-in period, the frictional resistances in the engine are greater during this period. The engine develops its maximum power after about 5 to 15 tank fillings.\n\n0458-250-0121-F\n\n18 Air filter\n\n17.2 During Operation\n\nAfter a long period of full throttle operation, allow the engine to run for a short while at idle speed so that engine heat can be dissipated by the flow of cooling air. This protects engine-mounted components (ignition, carburetor) from thermal overload.", "cd9c41bc-e638-4c47-817c-4fa03ae6def3"]
[{"id": null, "metadata": {"doc_id": "400aa9a0-c169-4bc0-b036-9bd31609ee5a", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions for maintaining and adjusting a machine, likely a small engine or power tool.\n\n1. **After Finishing Work**:\n   - For short-term storage, let the engine cool, empty the fuel tank, and store the machine in a dry, ignition-free area.\n   - For long-term storage, refer to the \"Storing the Machine\" section.\n\n2. **Air Filter Maintenance**:\n   - If engine power drops, clean or replace the air filter.\n   - Steps include removing the filter cover, cleaning around the filter, checking the filter element, and reinstalling it.\n\n3. **Carburetor Adjustment**:\n   - The carburetor is pre-set for optimal performance.\n   - Before adjusting, ensure the engine is off, the cutting attachment is mounted, and the air filter and throttle cable are in good condition.\n   - Standard settings: High speed screw (H) = 1 1/2 turns out, Low speed screw (L) = 1 turn out.\n   - Adjust the idle speed screw (LA) to ensure smooth engine operation without the cutting attachment rotating.\n   - If the cutting attachment rotates at idle, adjust the idle speed screw counterclockwise.\n   - For erratic idling or poor acceleration, adjust the low speed screw (L) counterclockwise up to 1/2 turn.\n\nWarnings are included to seek professional servicing if issues persist. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "17.3 After Finishing Work\n\nStoring for a short period: Wait for the engine to cool down. Empty the fuel tank and keep the machine in a dry place, well away from sources of ignition, until you need it again. For longer out- of-service periods – see \"Storing the Machine\".\n\n18 Air filter 18.1\n\nIf there is a noticeable loss of engine power\n\n= 250BA071 KN\n\n► Turn the choke knob to g. ► Press in the tab (1) and remove the filter\n\ncover (2).\n\n► Clean away loose dirt from around the filter (3) and inside the filter cover.\n\n► Remove and check the filter element – replace it if is dirty or damaged.\n\n► Install the filter element in the filter cover. ► Refit the filter cover.\n\n0458-250-0121-F\n\nEnglish\n\n19 Adjusting the Carburetor 19.1 General Information\n\nThe carburetor comes from the factory with a standard setting.\n\nThis setting provides an optimum fuel-air mixture under most operating conditions.\n\n19.2 ► Shut off the engine. ► Mount the cutting attachment. ► Check the air filter and clean or replace if nec‐\n\nessary.\n\n► Check that the throttle cable is properly adjus‐ ted – readjust if necessary – see chapter on \"Adjusting the Throttle Cable\".\n\n19.3 Standard Setting – High speed screw (H) = 1 1/2 – Low speed screw (L) = 1\n\n255BA006 KN \\\n\n► Turn the high speed screw (H) carefully clock‐ wise until it is against its seat, then turn it back 2 full turns.\n\n► Turn the low speed screw (L) carefully clock‐ wise as far as stop, then turn it back 1 turn\n\n19.4 ► Carry out standard setting. ► Start and warm up the engine.\n\n> 255BA007 KN \\\n\n31\n\nEnglish\n\n19.4.1 ► Turn the idle speed screw (LA) clockwise until the engine runs smoothly – the cutting attach‐ ment must not rotate.\n\n19.4.2 Cutting attachment rotates when engine is idling\n\n► Turn the idle speed screw (LA) counterclock‐ wise until the cutting attachment stops moving and then turn the screw another 1/2 to 1 full turn in the same direction.\n\nWARNING\n\nIf the cutting attachment continues to rotate when the engine is idling, have your machine checked and repaired by your servicing dealer.\n\n19.4.3 Erratic idling behavior, poor accelera‐ tion (even though setting of LA screw is correct).\n\nIdle setting is too lean ► Turn the low speed screw (L) counterclock‐ wise, no more than 1/2 turn, until the engine runs and accelerates smoothly.", "400aa9a0-c169-4bc0-b036-9bd31609ee5a"]
[{"id": null, "metadata": {"doc_id": "e57b0e49-9f1f-4906-9896-556ee11f8ed8", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions for troubleshooting and maintaining a small engine, likely for a piece of outdoor power equipment such as a chainsaw or trimmer. Key points include:\n\n1. **Erratic Idling Behavior**: Adjust the low-speed screw (L) and idle speed screw (LA) to ensure smooth engine operation.\n2. **High Altitude Operation**: Fine-tune the high-speed screw (H) for optimal performance at high altitudes, and reset to standard settings after returning to lower altitudes to avoid engine damage.\n3. **Spark Plug Maintenance**: \n   - Check and replace the spark plug if the engine is underperforming.\n   - Clean and adjust the spark plug as needed.\n   - Use only approved spark plugs and ensure the adapter nut is secure to prevent arcing.\n4. **Engine Running Behavior**: If issues persist despite clean air filters and proper carburetor and throttle adjustments, the muffler may need inspection for contamination by a professional.\n\nThe text emphasizes the importance of using approved parts and seeking professional servicing for complex issues. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "19.4.4 Erratic idling behavior\n\nIdle setting is too rich ► Turn the low speed screw (L) clockwise, no\n\nmore than 1/2 turn, until the engine runs and accelerates smoothly.\n\nIt is usually necessary to change the setting of the idle speed screw (LA) after every correction to the low speed screw (L).\n\n19.5 Fine Tuning for Operation at High Altitude\n\nA slight correction of the setting may be neces‐ sary if the engine does not run satisfactorily: ► Carry out standard setting. ► Warm up the engine. ► Turn high speed screw (H) slightly clockwise\n\n(leaner) – no more than a 3/4 turn.\n\n32\n\n20 Spark Plug\n\nNOTICE\n\nAfter returning from high altitude, reset the car‐ buretor to the standard setting.\n\nIf the setting is too lean there is a risk of engine damage due to insufficient lubrication and over‐ heating.\n\n20 Spark Plug ► If the engine is down on power, difficult to start or runs poorly at idle speed, first check the spark plug.\n\n► Fit a new spark plug after about 100 operating hours – or sooner if the electrodes are badly eroded. Install only suppressed spark plugs of the type approved by STIHL – see \"Specifica‐ tions\".\n\nRemoving the Spark Plug\n\n20.1 ► Turn off the engine.\n\n= : i) Ea > g\n\n► Pull off the spark plug boot (1). ► Unscrew the spark plug.\n\n20.2 Checking the Spark Plug\n\nit g\n\n► Clean dirty spark plug. ► Check electrode gap (A) and readjust if neces‐\n\nsary – see \"Specifications\".\n\n► Rectify the problems which have caused foul‐ ing of the spark plug.\n\nPossible causes are: – Too much oil in fuel mix.\n\n0458-250-0121-F\n\n21 Engine Running Behavior\n\n– Dirty air filter. – Unfavorable running conditions.\n\nWARNING \n\nArcing may occur if the adapter nut (1) is loose or missing. Working in an easily combustible or explosive atmosphere may cause a fire or an explosion. This can result result in serious inju‐ ries or damage to property.\n\n► Use resistor type spark plugs with a properly tightened adapter nut.\n\n20.3 Installing the Spark Plug\n\na\n\n► Screw the spark plug (2) into the cylinder and fit the boot (1) (press it down firmly).\n\n21 Engine Running Behavior If engine running behavior is unsatisfactory even though the air filter is clean and the carburetor\n\n0458-250-0121-F\n\n002BA446 KN\n\nEnglish\n\nand throttle cable are properly adjusted, the cause may be the muffler.\n\nHave the muffler checked by a servicing dealer for contamination (carbonization).\n\nSTIHL recommends that you have servicing and repair work carried out exclusively by an author‐ ized STIHL servicing dealer.", "e57b0e49-9f1f-4906-9896-556ee11f8ed8"]
[{"id": null, "metadata": {"doc_id": "75a6b0c9-1e5d-4316-a0ab-ffa68b74ba04", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed maintenance instructions for a gearbox and the starter rope and rewind spring of a machine.\n\n**Gearbox Maintenance:**\n1. **Without Screw Plug:** \n   - Maintenance-free, no lubrication needed.\n2. **With Screw Plug:** \n   - Check grease level every 25 hours.\n   - If no grease is visible, add up to 5g of STIHL gear lubricant.\n   - Do not overfill the gearbox.\n\n**Replacing the Starter Rope and Rewind Spring:**\n1. **Removing the Fan Housing:**\n   - Remove screws and fan housing.\n2. **Replacing the Starter Rope:**\n   - Remove spring clip, rope rotor, washer, and pawl.\n   - Replace the rope, tie knots, and reassemble components.\n3. **Tensioning the Rewind Spring:**\n   - Make a loop in the starter rope, turn the rotor counterclockwise six times.\n   - Ensure the starter grip is firm; if not, add another turn to increase tension.\n\n**Storing the Machine:**\n- Ensure all components are properly reassembled and tensioned. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "22 Lubricating the Gearbox 22.1 Gearbox without Screw Plug\n\n0000-GXX-1156-A0_\n\n► If the gearbox has no screw plug: gearbox is maintenance-free and requires no re-lubrica‐ tion.\n\n22.2 Gearbox with Screw Plug\n\n0000-GXX-1155-A0_\n\n► If the gearbox has a screw plug (1): Check grease level after every 25 hours of operation and re-lubricate if necessary.\n\n0000-GXX-0536-A0_\n\n► Remove the screw plug (1).\n\n33\n\nEnglish\n\n► If no grease can be seen on the inside of the screw plug (1): Screw the tube (2) of STIHL gear lubricant (special accessory) into the filler hole.\n\n► Squeeze no more than 5 g (1/5 oz) grease into the gearbox.\n\nNOTICE\n\nDo not completely fill the gearbox with grease.\n\n► Unscrew the tube (2). ► Insert the screw plug (1) and tighten it down\n\nfirmly.\n\n23 Replacing the Starter Rope and Rewind Spring\n\n23.1 Removing the Fan Housing\n\nZz ry 5 3 8 &\n\n► Take out the screws (1). ► Remove the fan housing.\n\n23.2 Replacing the Starter Rope\n\n(e) Zz x a oO Ss zt oO Fry &\n\n► Remove the spring clip (2). ► Carefully remove the rope rotor with\n\nwasher (3) and pawl (4).\n\n34\n\n23 Replacing the Starter Rope and Rewind Spring\n\nWARNING\n\nThe rewind spring may pop out and uncoil during this operation – take care to avoid the risk of injury.\n\n2 x 8 2 8 8 a\n\n► Pry the cap (5) out of the grip. ► Remove the remaining rope from the rotor and\n\nstarter grip.\n\n► Tie a simple overhand knot in the new rope and then thread it through the top of the grip and the rope bushing (6).\n\n► Refit the cap in the grip.\n\n256BA034 KN\n\n► Thread the rope through the rotor and secure it with a simple overhand knot.\n\n► Coat the rope rotor bearing bore with non-res‐ inous oil.\n\n► Slip the rotor over the starter post – turn it back and forth to engage the anchor loop of the rewind spring.\n\n0458-250-0121-F\n\n24 Storing the Machine\n\n256BA032 KN\n\n► Fit the pawl (4). ► Fit the washer (3). ► Push the spring clip (2) into position – it must point counterclockwise as shown and engage the pawl's peg.\n\n23.3 Tension the rewind spring.\n\n427BA016 KN\n\n► Make a loop in the unwound starter rope and use it to turn the rope rotor six full revolutions counterclockwise.\n\n► Hold the rope rotor steady. ► Pull out and straighten the twisted rope. ► Release the rope rotor. ► Slowly release the starter rope so that it winds\n\nonto the rotor.\n\nThe starter grip must sit firmly in the rope bush‐ ing. If the grip droops to one side: Add one more turn on the rope rotor to increase spring tension.", "75a6b0c9-1e5d-4316-a0ab-ffa68b74ba04"]
[{"id": null, "metadata": {"doc_id": "af6927b6-8118-4c8f-adf9-e2e6c27bbcf0", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides detailed instructions for maintaining and storing a machine, specifically focusing on the starter rope, rewind spring, and metal cutting blades. Key points include:\n\n1. **Starter Rope and Rewind Spring**:\n   - Ensure the starter rope can still rotate the rotor another 1.5 turns when fully extended.\n   - If the spring is overtensioned, remove one turn of the rope.\n   - Replace a broken rewind spring by removing the rope rotor, taking out screws, and replacing the spring housing.\n   - Lubricate the new spring and refit it if it uncoils.\n   - Refit the rope rotor and tension the spring.\n\n2. **Storing the Machine**:\n   - Drain and clean the fuel tank if the machine will be unused for 30 days or more.\n   - Dispose of fuel properly and run the engine until it stops.\n   - Clean and inspect the cutting attachment, and treat metal parts with protective oil.\n   - Thoroughly clean the machine and air filter.\n   - Store the machine in a dry, safe place out of reach of children and unauthorized users.\n\n3. **Sharpening Metal Cutting Blades**:\n   - Use a sharpening file for dull blades; for serious wear, use a grinder or consult a dealer.\n   - Sharpen frequently with minimal metal removal.\n   - Resharpen teeth uniformly without altering the blade contour.\n   - Check the balance of the cutting attachment after resharpening about five times, using a STIHL balancer or dealer services.\n\nThese instructions ensure the machine operates safely and efficiently while extending its lifespan. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "NOTICE\n\nWhen the starter rope is fully extended it must still be possible to rotate the rotor another one and a half turns. If this is not the case, the spring is overtensioned and could break.\n\n► Take one turn of the rope off the rotor. ► Install the fan housing.\n\n23.4 Replacing a Broken Rewind Spring\n\n► Remove the rope rotor as described in \"Replacing the Starter Rope\".\n\n0458-250-0121-F\n\nEnglish\n\nWARNING\n\nThe bits of the spring may still be under tension and could fly apart when you remove the rope rotor and spring housing. To reduce the risk of injury, Wear a face shield and work gloves.\n\n271BA053 KN\n\n► Take out the screws (7). ► Remove the spring housing and pieces of\n\nspring.\n\n► Lubricate the new, ready-to-fit replacement spring in the new spring housing with a few drops of resin-free oil.\n\n► Place the replacement spring with spring housing in position – bottom plate facing up.\n\nIf the spring pops out and uncoils, refit it in the clockwise direction, starting outside and working inwards. ► Fit the screws. ► Refit the rope rotor as described in \"Replacing\n\nthe Starter Rope\".\n\n► Tension the rewind spring. ► Install the fan housing.\n\n24 Storing the Machine If out of use for periods of about 30 days or lon‐ ger ► Drain and clean the fuel tank in a well-ventila‐\n\nted area.\n\n► Dispose of fuel properly in accordance with local environmental requirements.\n\n► If a manual fuel pump is fitted: Press the man‐ ual fuel pump at least 5 times.\n\n► Start the engine and run it at idling speed until it stops\n\n► Remove, clean and inspect the cutting attach‐ ment. Treat metal cutting attachments with protective oil.\n\n► Thoroughly clean the machine ► Cleaning the Air Filter ► Store the machine in a dry and safe place, out of the reach of children and other unauthor‐ ized users\n\n35\n\nEnglish\n\n25 Sharpening Metal Cutting Blades\n\n► Use a sharpening file (see \"Special Accesso‐ ries\") to sharpen dull cutting attachments. In case of more serious wear or nicks: Resharpen with a grinder or have the work done by a dealer – STIHL recommends a STIHL servicing dealer.\n\n► Sharpen frequently, take away as little metal as possible – two or three strokes of the file are usually enough.\n\n1 1 () 6 NX. 1 002BA083 KN\n\n► Resharpen the teeth (1) uniformly – do not alter the contour of the parent blade (2) in any way.\n\nSee cutting attachment packaging for additional sharpening instructions. Keep the packaging for future reference.\n\n25.1 ► After resharpening about 5 times, check the cutting attachment for out-of-balance on a STIHL balancer – see “Special Accessories” – or have it checked by a dealer and re-bal‐ anced as necessary – STIHL recommends a STIHL servicing dealer.\n\n36\n\n25 Sharpening Metal Cutting Blades", "af6927b6-8118-4c8f-adf9-e2e6c27bbcf0"]
[{"id": null, "metadata": {"doc_id": "a2acab76-1fb9-43b4-a563-d10de29c07a7", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions for maintaining the mowing head of a power tool, specifically focusing on handling and replacing the nylon line.\n\n1. **Placing Power Tool on the Ground**: \n   - Shut off the engine and lay the tool on its back with the cutting attachment facing up.\n\n2. **Replacing Nylon Line**:\n   - Check the mowing head for wear and replace it if necessary.\n   - Follow the illustrated instructions provided with the mowing head for replacing the nylon line.\n\n3. **Adjusting Nylon Line**:\n   - **STIHL SuperCut**: Fresh line advances automatically if it is at least 6 cm long, and the deflector blade trims it to the correct length.\n   - **STIHL AutoCut**: With the engine running, tap the rotating mowing head on the ground to advance the line, which the deflector blade then trims.\n   - **STIHL TrimCut**: Shut off the engine before manually adjusting the line. Pull the spool up, rotate it counterclockwise, and pull the line ends outward until they reach the limiter blade.\n\n4. **General Tips**:\n   - Avoid tapping the mowing head on the ground too often to prevent unnecessary cutting of the nylon line.\n   - Ensure both lines are at least 2.5 cm long for the line feed to operate correctly. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "26 Maintaining the Mowing Head\n\n26.1 Placing power tool on the ground\n\nf—_—_+ + 002BA104 KN\n\n► Shut off the engine. ► Lay your power tool on its back so that the cut‐ ting attachment mounting face is pointing up.\n\n26.2 Replacing Nylon Line\n\nAlways check the mowing head for signs of wear before replacing the nylon line.\n\nWARNING\n\nIf there are signs of serious wear, replace the complete mowing head.\n\nThe nylon mowing line is referred to as \"nylon line\" or \"line\" in the following.\n\nThe mowing head is supplied with illustrated instructions for replacing the nylon line. Keep the instructions for the mowing head in a safe place. ► If necessary, remove the mowing head.\n\n26.3 Adjusting Nylon Line\n\nSTIHL SuperCut\n\nFresh line is advanced automatically if the remaining line is at least 6 cm (2 1/2 in) long. The blade on the deflector trims overlong lines to the correct length.\n\nSTIHL AutoCut ► With the engine running, hold the rotating mowing head above the grass surface. ► Tap it on the ground once – fresh line is\n\nadvanced and the blade on the deflector trims it to the right length.\n\nFresh line is advanced every time the mowing head is tapped on the ground. For this reason observe the mowing head's cutting performance during operation. If the mowing head is tapped\n\n0458-250-0121-F\n\n27 Inspection and Maintenance by User\n\non the ground too often, the line limiting blade will unnecessarily cut off unused lengths of nylon line.\n\nLine feed operates only if both lines are still at least 2.5 cm (1 in) long.\n\nSTIHL TrimCut\n\nWARNING\n\nTo reduce the risk of injury, always shut off the engine before adjusting the nylon line by hand.\n\n► Pull the spool up – rotate it about 1/6 turn counterclockwise until it engages – and allow it to spring back.\n\n► Pull ends of the lines outward.\n\nRepeat the above procedure as necessary until both lines reach the limiter blade on the deflec‐ tor.\n\nRotating the spool from one stop to the next advances about 4 cm (1 1/2 in) of fresh line.\n\n26.4 Replacing Nylon Line", "a2acab76-1fb9-43b4-a563-d10de29c07a7"]
[{"id": null, "metadata": {"doc_id": "7b895119-6083-4e51-ba40-215ac58bf578", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides detailed instructions and warnings for maintaining and replacing parts of STIHL PolyCut and DuroCut mowing heads. Key points include:\n\n1. **Nylon Line and Cutting Blades**: Precut lengths of nylon line can replace cutting blades in the PolyCut. Always shut off the engine before refilling or replacing blades to reduce injury risk.\n2. **Replacing Cutting Blades**: Check the mowing head for wear before installing new blades. If there is serious wear, replace the entire mowing head. Follow the illustrated instructions provided with the mowing head.\n3. **Fuel Pickup Body**: Change the fuel pickup body annually by draining the fuel tank, removing the old pickup body, and installing a new one.\n4. **Dealer Maintenance**: STIHL recommends having servicing and repair work done by authorized dealers.\n5. **Antivibration Element**: Check the vibration-absorbing rubber element between the powerhead and drive tube for wear or increased vibration.\n6. **Maintenance Intervals**: Follow specified maintenance intervals for normal conditions, adjusting for longer or more difficult cutting conditions. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "STIHL PolyCut\n\nPrecut lengths of nylon line can be fitted to the PolyCut in place of the cutting blades.\n\nSTIHL DuroCut, STIHL PolyCut\n\nA\n\nWARNING\n\nTo reduce the risk of injury, always shut off the engine before refilling the mowing head.\n\n► Fit precut lengths of nylon line in the mowing head as described in the instructions supplied.\n\n26.5 Replacing Cutting Blades\n\n26.5.1 STIHL PolyCut\n\nAlways check the mowing head for signs of wear before installing new cutting blades.\n\nA\n\nWARNING\n\nIf there are signs of serious wear, replace the complete mowing head.\n\nThe thermoplastic cutting blades are referred to as \"blades\" in the following.\n\nThe mowing head is supplied with illustrated instructions for replacing the blades. Keep the instructions for the mowing head in a safe place.\n\n0458-250-0121-F\n\nEnglish\n\nWARNING\n\nTo reduce the risk of injury, always shut off the engine before installing the blades.\n\n► Remove the mowing head. ► Replace blades as shown in the illustrated\n\ninstructions.\n\n► Mount the mowing head on the machine.\n\n27 Inspection and Mainte‐ nance by User\n\n27.1 Changing the Fuel Pickup Body\n\n— O 250BA072 KN\n\nChange the fuel pickup body every year: ► Drain the fuel tank. ► Use a hook to pull the fuel pickup body out of\n\nthe tank and take it off the hose.\n\n► Push the new pickup body into the hose. ► Place the pickup body in the tank.\n\n28 Inspections and Mainte‐\n\nnance by Dealer 28.1 Maintenance Work\n\nSTIHL recommends that you have servicing and repair work carried out exclusively by an author‐ ized STIHL servicing dealer.\n\n37\n\nEnglish\n\nEnglish\n\n29 Maintenance and Care\n\n28.2 Antivibration Element\n\ng\n\nA vibration-absorbing rubber element is installed between the powerhead and the drive tube. Have it checked if there are signs of wear or a noticeable increase in vibration levels.\n\n29 Maintenance and Care\n\nk r o w g n i t r a t s\n\ny\n\nd e\n\ny k e e W\n\ny h t n o M\n\ny\n\ny t l u a f\n\nd e g a m a d\n\nThe following intervals apply for normal operating conditions. The specified intervals must be short‐ ened accordingly when working for longer than nor‐ mal or under difficult cutting conditions (extensive dust, etc.).", "7b895119-6083-4e51-ba40-215ac58bf578"]
[{"id": null, "metadata": {"doc_id": "8cbc0239-1454-422e-9631-2dc575530073", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text appears to be an excerpt from a maintenance schedule for a piece of equipment, likely a power tool or small engine. It lists components such as the control handle, air filter, fuel tank, carburetor, and spark plug. The text indicates that maintenance intervals should be adjusted based on operating conditions, especially if the equipment is used for extended periods or in challenging environments like those with extensive dust. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Control handle Air filter\n\nFuel tank Carburetor\n\nSpark plug\n\nd e r i u q e r\n\n38\n\n0458-250-0121-F\n\n30 Minimize Wear and Avoid Damage\n\nEnglish\n\nk r o w g n i t r a t s\n\n|2\n\ny\n\nd e\n\ny k e e W\n\ny h t n o M\n\ny\n\n|=\n\ny t l u a f\n\nd e g a m a d\n\nThe following intervals apply for normal operating conditions. The specified intervals must be short‐ ened accordingly when working for longer than nor‐ mal or under difficult cutting conditions (extensive dust, etc.).", "8cbc0239-1454-422e-9631-2dc575530073"]
[{"id": null, "metadata": {"doc_id": "a9559a17-b197-407d-8c9d-bd42b9d8d6af", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text is a safety information label for STIHL power tools. It emphasizes the importance of regular maintenance as outlined in the \"Maintenance Chart\" to minimize wear and avoid damage. Key points include:\n\n1. Maintenance should be performed regularly, preferably by authorized STIHL dealers.\n2. Following the manual's instructions reduces the risk of unnecessary wear and damage.\n3. The user is responsible for any damage caused by not following safety, operating, and maintenance instructions.\n4. Unauthorized modifications, unsuitable tools or accessories, improper use, and continued use of defective components can cause damage.\n5. Specific damages mentioned include engine damage from neglect, corrosion from improper storage, and damage from poor quality replacement parts.\n\nSTIHL recommends using authorized dealers for servicing and repairs to ensure proper care and technical expertise. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "d e r i u q e r\n\nSafety information label 1)STIHL recommends STIHL dealers 2)see chapter \"Inspection and Maintenance by Dealer\", section \"Antivibration Elements\" 30 Minimize Wear and Avoid\n\nDamage\n\nAll the operations described in the \"Maintenance Chart\" must be performed on a regular basis. If these maintenance operations cannot be per‐ formed by the owner, they should be performed by a servicing dealer.\n\nObserving the instructions in this manual helps reduce the risk of unnecessary wear and dam‐ age to the power tool.\n\nThe power tool must be operated, maintained and stored with the due care and attention described in this owner's manual.\n\nThe user is responsible for all damage caused by non-observance of the safety precautions, oper‐ ating and maintenance instructions in this man‐ ual. This includes in particular: – Alterations or modifications to the product not\n\napproved by STIHL.\n\n– Using tools or accessories which are neither approved or suitable for the product or are of a poor quality.\n\n– Using the product for purposes for which it was not designed.\n\n– Using the product for sports or competitive events.\n\n– Consequential damage caused by continuing to use the product with defective components.\n\nSTIHL recommends that you have servicing and repair work carried out exclusively by an author‐ ized STIHL servicing dealer. STIHL dealers are regularly given the opportunity to attend training courses and are supplied with the necessary technical information.\n\nIf these maintenance operations are not carried out as specified, the user assumes responsibility for any damage that may occur. Among other parts, this includes: – Damage to the engine due to neglect or defi‐ cient maintenance (e.g. air and fuel filters), incorrect carburetor adjustment or inadequate cleaning of cooling air inlets (intake ports, cyl‐ inder fins).\n\n– Corrosion and other consequential damage resulting from improper storage.\n\n0458-250-0121-F\n\n39\n\nEnglish\n\n– Damage to the machine resulting from the use of poor quality replacement parts.", "a9559a17-b197-407d-8c9d-bd42b9d8d6af"]
[{"id": null, "metadata": {"doc_id": "44dbb656-3d1a-48d3-b829-d7c4beec4dba", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "### Summary\n\n**Parts Subject to Wear and Tear:**\nCertain components of the power tool are prone to normal wear and tear and may need timely replacement based on usage. These include:\n- Cutting attachments and their mounting hardware\n- Deflectors for cutting attachments\n- Clutch\n- Air and fuel filters\n- Rewind starter\n- Spark plug\n- Antivibration elements\n\n**Main Parts:**\nThe main parts of the power tool are listed with their respective numbers, including:\n1. Tank cap\n2. Carburetor adjusting screws\n3. Starter grip\n4. Spark plug boot\n5. Muffler\n6. Bike handle (handlebar)\n7. Throttle trigger\n8. Slide control\n9. Throttle trigger lockout\n10. Handle support\n11. Throttle cable retainer\n12. Carrying ring\n13. Manual fuel pump\n14. Choke knob\n15. Air filter cover\n16. Fuel tank\n17. Machine support\n18. Loop handle\n19. Barrier bar (country specific)\n\n**Additional Parts for Mowing:**\n1. Drive tube\n2. Mowing head\n3. Deflector for mowing heads only\n4. Line limiting blade\n5. Deflector for all mowing attachments\n6. Skirt for mowing heads\n7. Metal mowing attachment\n8. Circular saw blade\n9. Limit stop for circular saw blades only\n\n**Specifications:**\n- Engine: STIHL single cylinder two-stroke engine\n- Model FS 120: Displacement of 30.8 cc \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "30.2 Parts Subject to Wear and Tear\n\nSome parts of the power tool are subject to nor‐ mal wear and tear even during regular operation in accordance with instructions and, depending on the type and duration of use, have to be replaced in good time. Among other parts, this includes: – Cutting attachments (all types) – Mounting hardware for cutting attachments\n\n(rider plate, nut, etc.)\n\n– Deflectors for cutting attachments – Clutch – Filters (air, fuel) – Rewind starter – Spark plug – Antivibration elements\n\n31 Main Parts\n\n1 Tank cap\n\nON OAR WD\n\n2 Carburetor adjusting screws\n\n3 Starter grip\n\n4 Spark plug boot\n\n5 Muffler\n\n6 Bike handle (handlebar)\n\n7 Throttle trigger\n\n8 Slide control\n\n9 Throttle trigger lockout\n\n10 Handle support\n\n11 Throttle cable retainer\n\n12 Carrying ring\n\n40\n\n31 Main Parts\n\n13 Manual fuel pump\n\n14 Choke knob\n\n15 Air filter cover\n\n16 Fuel tank\n\n17 Machine support\n\n18 Loop handle\n\n19 Barrier bar (country specific)\n\n# Serial number\n\n1 Drive tube\n\nCOAONOAR WH\n\n2 Mowing head\n\n3 Deflector for mowing heads only\n\n4 Line limiting blade\n\n5 Deflector for all mowing attachments\n\n6 Skirt for mowing heads\n\n7 Metal mowing attachment\n\n8 Circular saw blade\n\n9 Limit stop for circular saw blades only\n\n32 Specifications Engine 32.1\n\nSTIHL single cylinder two-stroke engine\n\n32.1.1 FS 120\n\nDisplacement:\n\nDisplacement:\n\n30.8 cc\n\n0458-250-0121-F\n\n32 Specifications", "44dbb656-3d1a-48d3-b829-d7c4beec4dba"]
[{"id": null, "metadata": {"doc_id": "b8d5773d-8c6c-4c01-bb30-c01dcc2702a2", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text appears to describe specifications for an engine, specifically for a model labeled \"FS 250.\" It mentions the bore and stroke dimensions and states the engine power as 1.3 kW (1.8 bhp) according to ISO 8893 standards. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Bore: Stroke: Engine power to ISO 8893: 1.3 kW (1.8 bhp) at\n\n32.1.2 FS 250", "b8d5773d-8c6c-4c01-bb30-c01dcc2702a2"]
[{"id": null, "metadata": {"doc_id": "a574e8e2-0e34-445c-8897-24a5cf181a22", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides technical specifications for an engine. It includes details about the engine's displacement, bore, stroke, and power output (1.6 kW or 2.2 bhp). The ignition system is an electronic magneto ignition, and the recommended spark plugs are NGK BPMR 7 A or Bosch WSR 6 F with a 0.5 mm gap. The fuel system features an all-position diaphragm carburetor with an integral fuel pump, and the fuel tank capacity is 640 cc (0.64 liters). Weight information is mentioned but not detailed. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Displacement: Bore: Stroke: Engine power to ISO 8893: 1.6 kW (2.2 bhp) at\n\n32.2 Ignition System\n\nElectronic magneto ignition\n\nSpark plug (resistor type): NGK BPMR 7 A, Bosch WSR 6 F 0.5 mm\n\n32.3 Fuel System\n\nAll position diaphragm carburetor with integral fuel pump\n\nFuel tank capacity: 640 cc (0.64 l)\n\n32.4 Weight", "a574e8e2-0e34-445c-8897-24a5cf181a22"]
[{"id": null, "metadata": {"doc_id": "603d8a3b-773c-4032-a7e9-f38ceb1c86f1", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text appears to be an excerpt from a product manual, likely for a power tool such as a trimmer or brushcutter. It includes the following details:\n\n- **Overall Length**: 1765 mm without the cutting attachment.\n- **Features**: Includes a loop handle.\n- **Noise and Vibration Values**: References compliance with the Vibration Directive 2002/44/EC and provides a link for further details.\n- **Sound Pressure Levels**: Lists sound pressure levels in accordance with ISO 22868 for different models (FS 120 and FS 250) with various mowing heads and metal mowing tools. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "32.5 Overall length\n\nwithout cutting attachment 1765 mm\n\n32.6 Features\n\nR Loop handle\n\n32.7 Noise and vibration values\n\nFor further details on compliance with Vibration Directive 2002/44/EC, see\n\nwww.stihl.com/vib\n\n32.7.1 Sound pressure level Lpeq in accord‐ ance with ISO 22868\n\nwith mowing head FS 120: FS 250: with metal mowing tool FS 120: FS 250:", "603d8a3b-773c-4032-a7e9-f38ceb1c86f1"]
[{"id": null, "metadata": {"doc_id": "dab26a66-b97e-4f3d-8cc2-35c3ac95231f", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text provides information about the sound power level, specifically 98 dB(A) and 100 dB(A), measured according to ISO 22868 standards. The reference number 0458-250-0121-F and the language (English) are also mentioned. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "98 dB(A) 100 dB(A)\n\n0458-250-0121-F\n\nEnglish\n\n32.7.2 Sound power level Lweq to ISO 22868", "dab26a66-b97e-4f3d-8cc2-35c3ac95231f"]
[{"id": null, "metadata": {"doc_id": "9a9909c1-f98e-4960-82cb-690a97f6e343", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The table compares the noise levels of two models, FS 120 and FS 250, when equipped with different mowing tools. With a mowing head, the FS 120 produces 107 dB(A) and the FS 250 produces 109 dB(A). The same noise levels apply when using a metal mowing tool. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "with mowing head FS 120: FS 250: with metal mowing tool FS 120: FS 250:\n\n107 dB(A) 109 dB(A)", "9a9909c1-f98e-4960-82cb-690a97f6e343"]
[{"id": null, "metadata": {"doc_id": "a247af01-f1c1-40e1-a2ae-c303b0a8aff7", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text includes various sections related to the maintenance, compliance, and disposal of a STIHL machine:\n\n1. **Vibration Level**: The vibration level ahv,eq is measured in accordance with ISO 22867, with specific values provided for different conditions. The K-factor for sound pressure and vibration levels is specified as 2.0 dB(A) and 2.0 m/s² respectively, in accordance with Directive 2006/42/EC.\n\n2. **REACH Compliance**: REACH is an EC regulation concerning the Registration, Evaluation, Authorization, and Restriction of Chemical substances. Compliance information can be found on the STIHL website.\n\n3. **Exhaust Emissions**: CO2 values measured in the EU type approval procedure are available on the STIHL website. These values are determined under standardized laboratory conditions and do not guarantee specific engine performance. Compliance with exhaust emission requirements is contingent on proper usage and maintenance as described in the user manual.\n\n4. **Maintenance and Repairs**: Users should only perform maintenance and service work described in the user manual. Other repairs should be done by authorized STIHL servicing dealers, who are trained and provided with necessary technical information. Only use approved or high-quality replacement parts to avoid accidents and damage.\n\n5. **Disposal**: For disposal, contact local authorities or a STIHL servicing dealer. STIHL products and packaging should be taken to a suitable collection point for recycling according to local regulations and should not be disposed of with domestic waste. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Vibration level ahv,eq in accordance with ISO 22867\n\nright 4.2 m/s2 10.5 m/s2 5.4 m/s2\n\n5.3 m/s2\n\nFS 250:\n\nThe K‑factor in accordance with Directive 2006/42/EC is 2.0 dB(A) for the sound pressure level and sound power level; the K‑factor in accordance with Directive 2006/42/EC is 2.0 m/s2 for the vibration level.\n\n32.8 REACH\n\nREACH is an EC regulation and stands for the Registration, Evaluation, Authorization and Restriction of Chemical substances.\n\nFor information on compliance with the REACH regulation (EC) No. 1907/2006 see\n\nwww.stihl.com/reach\n\n32.9 Exhaust Emissions\n\nThe CO2 value measured in the EU type appro‐ val procedure is specified at\n\nwww.stihl.com/co2\n\nin the product-specific technical data.\n\nThe measured CO2 value was determined on a representative engine in accordance with a standardized test procedure under laboratory conditions and does not represent either an explicit or implied guarantee of the performance of a specific engine.\n\nThe applicable exhaust emission requirements are fulfilled by the intended usage and mainte‐ nance described in this User Manual. The oper‐ ating license shall be void if the engine is modi‐ fied in any way.\n\n41\n\nEnglish\n\n33 Maintenance and Repairs Users of this machine may only carry out the maintenance and service work described in this user manual. All other repairs must be carried out by a servicing dealer.\n\nSTIHL recommends that you have servicing and repair work carried out exclusively by an author‐ ized STIHL servicing dealer. STIHL dealers are regularly given the opportunity to attend training courses and are supplied with the necessary technical information.\n\nWhen repairing the machine, only use replace‐ ment parts which have been approved by STIHL for this power tool or are technically identical. Only use high-quality replacement parts in order to avoid the risk of accidents and damage to the machine.\n\nSTIHL recommends the use of original STIHL replacement parts.\n\nOriginal STIHL parts can be identified by the STIHL part number, the { logo and the STIHL parts symbol K (the symbol may appear alone on small parts).\n\n34 Disposal Contact the local authorities or your STIHL serv‐ icing dealer for information on disposal.\n\nImproper disposal can be harmful to health and pollute the environment.\n\nyy +4 a 000BA073 KN\n\n► Take STIHL products including packaging to a suitable collection point for recycling in accord‐ ance with local regulations.\n\n► Do not dispose with domestic waste.", "a247af01-f1c1-40e1-a2ae-c303b0a8aff7"]
[{"id": null, "metadata": {"doc_id": "bd2fb8bb-6033-42b9-824b-e65a3569d546", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text appears to be part of an EC Declaration of Conformity issued by ANDREAS STIHL AG & Co. KG, a company based in Waiblingen, Germany. The document likely pertains to maintenance and repairs, and the company is declaring something under their sole responsibility. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "35 EC Declaration of Con‐ formity\n\nANDREAS STIHL AG & Co. KG Badstr. 115 D-71336 Waiblingen\n\nGermany\n\n42\n\n33 Maintenance and Repairs\n\ndeclares under our sole responsibility that", "bd2fb8bb-6033-42b9-824b-e65a3569d546"]
[{"id": null, "metadata": {"doc_id": "0490da49-e63c-4433-af21-bd76addb8c76", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The text states that the product complies with several EU Directives (2011/65/EU, 2006/42/EC, 2014/30/EU, and 2000/14/EC) and has been developed according to specific standards (EN ISO 11806-1, EN 55012, EN 61000‑6‑1). It also mentions that the sound power levels have been measured and guaranteed in accordance with Directive 2000/14/EC and ISO 10884. The measured sound power levels are 30.8 cm³ and 40.2 cm³. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "30.8 cm3 40.2 cm3\n\nconforms to the relevant provisions of Directives 2011/65/EU, 2006/42/EC, 2014/30/EU and 2000/14/EC and has been developed and manu‐ factured in compliance with the following stand‐ ards in the versions valid on the date of produc‐ tion:\n\nEN ISO 11806-1, EN 55012, EN 61000‑6‑1\n\nThe measured and the guaranteed sound power level have been determined in accordance with Directive 2000/14/EC, Annex V, and standard ISO 10884.\n\nMeasured sound power level", "0490da49-e63c-4433-af21-bd76addb8c76"]
[{"id": null, "metadata": {"doc_id": "f725cba7-4117-4cfc-bba9-72c548faafa4", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The table provides the guaranteed sound power levels for two models, FS 120 and FS 250, both of which are 112 dB(A). \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "FS 120: FS 250:\n\n112 dB(A) 112 dB(A)\n\nGuaranteed sound power level", "f725cba7-4117-4cfc-bba9-72c548faafa4"]
[{"id": null, "metadata": {"doc_id": "0a6eaa3f-6102-49f4-a68b-4d734ca61a08", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text appears to be an excerpt from a technical document or manual related to a product manufactured by ANDREAS STIHL AG & Co. KG. Key points include:\n\n- Sound levels for models FS 120 and FS 250 are both 114 dB(A).\n- The document is associated with the product approval department of ANDREAS STIHL AG & Co. KG.\n- The product's year of manufacture and serial number are indicated on the product itself.\n- The document is dated August 1, 2022.\n- Robert Olma, Vice President of Regulatory Affairs & Global Governmental Relations, is mentioned.\n- The document includes references to addresses and a website (www.stihl.com).\n- There are multiple references to a document number: 0458-250-0121-F. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "FS 120: FS 250:\n\n114 dB(A) 114 dB(A)\n\nTechnical documents deposited at:\n\nANDREAS STIHL AG & Co. KG Produktzulassung\n\nThe year of manufacture and serial number are applied to the product.\n\nWaiblingen, 2022-08-01\n\nANDREAS STIHL AG & Co. KG\n\npp\n\nCY\n\nRobert Olma, Vice President, Regulatory Affairs & Global Governmental Relations\n\ncE\n\n36 Addresses www.stihl.com\n\n0458-250-0121-F\n\n36 Addresses\n\n0458-250-0121-F\n\nEnglish\n\n43\n\nwww.stihl.com\n\n*04582500121F*  0458-250-0121-F \n\n* F 1 2 1 0 0 5 2 8 5 4 0 * \n\nF - 1 2 1 0 - 0 5 2 - 8 5 4 0", "0a6eaa3f-6102-49f4-a68b-4d734ca61a08"]
[{"id": null, "metadata": {"doc_id": "6252b2ba-926e-4218-8c8f-82030bb0dd0d", "source_file": "How to Operate a Brushcutter _ Guides & Projects _ STIHL USA.pdf"}, "page_content": "The text is a guide from STIHL USA on how to operate a brushcutter. It includes:\n\n1. **Pre-Use Checklist**: \n   - Ensure the engine is off and cool before refueling.\n   - Check the environment for hazards.\n   - Maintain a safe distance from others (50 feet or more).\n   - Ensure attachments are securely mounted.\n   - Adjust harness and handles to fit your height.\n\n2. **Personal Protective Equipment Checklist**:\n   - Wear a brush shield with built-in hearing protection.\n   - Use ear plugs or ear muffs for hearing protection.\n   - Wear protective glasses under the brush shield.\n   - Use heavy-duty work gloves.\n   - Wear long pants made of heavy material.\n   - Use sturdy, nonslip boots, preferably steel-toe safety boots.\n\n3. **Brushcutter Starting Procedure**:\n   - Start in a well-ventilated area, at least 10 feet away from the fueling spot.\n   - Press the primer bulb at least 5 times if present.\n   - Use the choke if the engine is cold.\n   - Ensure secure footing and that the cutting attachment is not touching anything before starting the brushcutter. \n Source File: How to Operate a Brushcutter _ Guides & Projects _ STIHL USA.pdf", "type": "Document"}, "26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\nSELECT YOUR STORE\n\nSTIHL\n\nWhat can we help you ﬁnd?\n\nHow to Operate A Brushcutter ƒ\n\nFrom pre-use checklists to basic operation techniques and storage tips, STIHL trimmers are known for their ability to cut weeds and overgrown grass, but they can do much more. With optional interchangeable cutting heads, you can turn your STIHL trimmer into a power brushcutting machine.\n\nPre-Use Checklist\n\nSwitch oﬀ the engine completely and allow it to cool before refueling.\n\nCheck working environment for any hazards.\n\nKeep a safe distance from other people (50 feet or more).\n\nKeep a safe distance from other people (50 feet or more).\n\ne\n\nEnsure attachments are mounted correctly and securely.\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\nQ\n\n1/10\n\n26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\nAdjust the harness and handle(s) to suit your height.\n\nPersonal Protective Equipment Checklist\n\nBrush Shield – To help reduce the risk of injury to the head and face, wear a brush shield with built-in\n\nhearing protection.\n\nHearing Protection – To help protect your hearing, wear sound barriers like ear plugs or ear muﬀs.\n\nProtective Glasses – Protective glasses should be worn under the brush shield as your primary defense against getting wood chips or other particulates in the eyes.\n\ne\n\nGloves – To help protect your hands, always wear heavy-duty work gloves made of leather or other wear- resistant material.\n\nLeg Protection – To help protect your legs, wear long pants made of heavy material.\n\nProtective Boots – To help maintain good footing, wear sturdy boots with nonslip soles. Steel-toe safety\n\nboots are recommended.\n\nBrushcutter Starting Procedure\n\ne Start in a well-ventilated area.\n\nStart in a well-ventilated area.\n\nMove at least 10 feet away from your fueling spot.\n\nPress the primer bulb at least 5 times (if unit has a primer bulb).\n\nUse choke if the engine is cold.\n\nMake sure you have secure footing.\n\nEnsure the cutting attachment is not touching anything.\n\nStart your brushcutter.", "6252b2ba-926e-4218-8c8f-82030bb0dd0d"]
[{"id": null, "metadata": {"doc_id": "4a54c5aa-0288-4341-9afa-67c6d8552717", "source_file": "How to Operate a Brushcutter _ Guides & Projects _ STIHL USA.pdf"}, "page_content": "The text provides detailed instructions on how to effectively use a brushcutter for various tasks:\n\n1. **Basic Technique**: Use a right-to-left cutting motion because the cutting attachment rotates counter-clockwise, causing trimmings to fall on the cut area.\n2. **Trimming Long Grass**: For long grass or tough weeds, make two passes: the first pass (right to left) cuts the top, and the second pass (left to right) removes the remaining grass.\n3. **Mowing Large Areas**: Use the square method by dividing the area into squares and working from the outside toward the center.\n4. **Mowing on a Hill**: Use the strip method by cutting a strip parallel to the slope, returning along the swath, and then cutting the next strip above.\n5. **Trimming Around Obstacles**: Use the deflector on the brushcutter to guide you around trees or bushes to avoid damaging them. Clear around closely growing plants before mowing.\n\nThese techniques ensure efficient and safe operation of a brushcutter in different scenarios. \n Source File: How to Operate a Brushcutter _ Guides & Projects _ STIHL USA.pdf", "type": "Document"}, "https://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\n2/10\n\n26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\nphir rl aanty\n\nBasic Technique\n\nBecause the cutting attachment rotates counter-clockwise, a right-to-le cutting motion is recommended. The advantage of this method is that the trimmings fall on the cut area.\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\n3/10\n\n26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\nTrimming for Long Grass\n\nWhen working in very long grass or tough weeds, two passes are recommended. An initial pass, right to le, cuts the top of the grass. Then, a lower pass, le to right, removes the remaining grass. The trimmings will discard to the le.\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\n4/10\n\n26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\n| ‘ \\\"\\ Vipera [fy s\\\" \\ Wh My! Wye ay [ANS \\y Davy ae ye THORN AVS NT ah WR HTIR UTORRENT \\\\\n\nMowing rge, Ft Areas\n\nThe best way to cut large areas is to use the square method. Divide the area to be mown into squares, and\n\nthen work along the outsides toward the center.\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\n5/10\n\n26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\nMowing on a Hill – The Strip Method\n\nThe strip method is a good way to mow a slope. Cut a strip parallel to the slope, and then return along the\n\nswath. Then, cut the next strip above and repeat.\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\n6/10\n\n26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\nTrimming Around Obstacles\n\nThe “mowing line” created by the trimmer is the best way of navigating right up to trees or bushes without damaging them. If several plants are growing close together, try to clear around them before mowing. To do that, use the deﬂector on your brushcutter as a guide. Place the deﬂector up against the base of the tree or bush and use it to guide you as you move. That protects the trunk while mowing the area around it.", "4a54c5aa-0288-4341-9afa-67c6d8552717"]
[{"id": null, "metadata": {"doc_id": "12dba641-06b3-43f4-a20b-b619900a1b11", "source_file": "How to Operate a Brushcutter _ Guides & Projects _ STIHL USA.pdf"}, "page_content": "The text provides instructions on how to properly use and operate a brushcutter, specifically focusing on the use of shoulder harnesses, suspension eyelets, and achieving proper balance and position. Key points include:\n\n1. **Shoulder Harness and Suspension Eyelet**: The harness should be worn so that the spring hook is about a hand’s width below the right hip, and the machine should be suspended from the eyelet using the spring hook.\n\n2. **Proper Balance**: Adjust the handles and carrying ring to balance the brushcutter, ensuring the cutting attachment is just above the ground for optimal cutting angle.\n\n3. **Brushcutter Position**: The correct position involves slightly bent arms and straight wrists. Specific tips for using the circular saw blade can be found in the product’s instruction manual.\n\n4. **Holding Loop-Handle Trimmers**: Always use both hands, with the left hand on the loop handle and the right hand on the shaft handle. The shoulder strap should be attached so the hook is about a hand’s width below the right hip.\n\nFor more detailed information, users are advised to refer to their product’s instruction manual. Additionally, there is a prompt to sign up for the STIHL newsletter for updates. \n Source File: How to Operate a Brushcutter _ Guides & Projects _ STIHL USA.pdf", "type": "Document"}, "Holding Bike–Handle Brushcutters\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\n7/10\n\n26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\nSHOULDER HARNESS\n\nSUSPENSION EYELET\n\nWhen putting on the harness, the spring hook should be about a hand’s width below your right hip.\n\nSuspend the machine from the eyelet using the spring\n\nhook.\n\nPROPER BALANCE\n\nBRUSHCUTTER POSITION\n\nAdjust the handles and push the carrying ring along the sha until the brushcutter is balanced. The cutting attachment should be just above the ground. The optimum cutting angle is automatically achieved when\n\nThe correct brushcutter position is with your arms slightly bent and your wrists straight. Please refer to your product’s instruction manual for speciﬁc tips on using the circular saw blade.\n\nthe machine is balanced.\n\nHolding Loop-Handle Trimmers\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\n8/10\n\n26/06/2024, 13:44\n\nHow to Operate a Brushcutter | Guides & Projects | STIHL USA\n\nSHOULDER STRAP\n\nOPERATION\n\nFirst, put on the shoulder strap and attach the hook to the carrying ring on the machine. The hook should be\n\nabout a hand’s width below your right hip.\n\n=\n\nAlways hold the trimmer / brushcutter with both hands. Your le hand should be on the loop handle and your right hand on the sha handle.\n\nFor more information speciﬁc to your model, view the product instruction manual.\n\nSTAY UP TO DATE WITH THE STIHL NEWSLETTER\n\nE-MAIL ADDRESS\n\nSIGN UP TO THE NEWSLETTER\n\n#REALSTIHL\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\nhttps://www.stihlusa.com/guides-projects/a/using-a-brushcutter/\n\n9/10", "12dba641-06b3-43f4-a20b-b619900a1b11"]
[{"id": null, "metadata": {"doc_id": "22dbe4d0-42e4-4f14-9d32-84fb4e0c2ff7", "source_file": "product_accessories.csv"}, "page_content": "The table lists various trimmer and brushcutter accessories from STIHL, including their names, descriptions, images, and suitable usage tags. Here is a concise summary of each accessory:\n\n1. **AutoCut Line Heads**: Mowing head using nylon line, advances line when tapped against the ground. Suitable for wet grass and garden areas. Models: AutoCut 2-2, 5-2, 11-2, 27-2, 36-2, 46-2, 56-2.\n\n2. **AutoCut EasySpool™ Line Heads**: Fast-loading residential trimming heads with EasySpool™ and TapAction™. Suitable for pavement and building areas. Models: AutoCut C 4-2, C 6-2, C 26-2.\n\n3. **Brush Knife**: Steel triple blade for trimming tough, tangled grass, scrub, and thorny bushes. Suitable for thick grass.\n\n4. **Circular Saw Blade - Chisel Tooth**: Steel chisel tooth saw blade for sawing and clearing gnarled bushes and thin tree trunks. Suitable for thin trees.\n\n5. **STIHL SuperCut™ Line Head**: Features fully automatic line feed for optimal cutting performance. Suitable for farm use.\n\n6. **Grass Cutting Blade**: Blade for mowing thick, dry grass and reeds, available in four-tooth or eight-tooth models. Suitable for thick and dry grass.\n\n7. **TrimCut™ Line Head**: Manual-feed mowing head ideal for low-growing grass around solid obstacles. Suitable for short grass, stones, and garden areas. \n Source File: product_accessories.csv", "type": "Document"}, "\n\n\naccessory_link\naccessory_image\naccessory_name\naccessory_description\nTags\n\n\nhttps://www.stihlusa.com/products/trimmers-and-brushcutters/trimmer-heads-and-blades/autocut/?aqid=7cc82ad014514d263bcc251fea31117b\nhttps://stihlusa-images.imgix.net/Product/786/autocut.png?w=300&h=300\nAutoCut Line Heads\nMowing head that uses nylon line. Advances cutting line when \"tapped\" against the ground at full throttle.\\n Models include: AutoCut 2-2, 5-2, 11-2, 27-2, 36-2, 46-2, 56-2\nWet Grass, Garden\n\n\nhttps://www.stihlusa.com/products/trimmers-and-brushcutters/trimmer-heads-and-blades/autocutc/?aqid=7cc82ad014514d263bcc251fea31117b\nhttps://stihlusa-images.imgix.net/Product/791/autocutc.png?w=300&h=300\nAutoCut EasySpool™ Line Heads\nThese AutoCut® cutting heads with EasySpool™ and TapAction™ are made for fast-loading residential trimming.\\n  \\n Models include: AutoCut C 4-2, C 6-2, C 26-2\nPavement, Building\n\n\nhttps://www.stihlusa.com/products/trimmers-and-brushcutters/trimmer-heads-and-blades/brushknife/?aqid=7cc82ad014514d263bcc251fea31117b\nhttps://stihlusa-images.imgix.net/Product/794/brushknife.png?w=300&h=300\nBrush Knife\nWith a steel triple blade, this brush knife is ideal for trimming and removing tough, tangled grass, scrub, and thorny bushes.\nThick grass\n\n\nhttps://www.stihlusa.com/products/trimmers-and-brushcutters/trimmer-heads-and-blades/circularchisel/?aqid=7cc82ad014514d263bcc251fea31117b\nhttps://stihlusa-images.imgix.net/Product/797/circularchisel.png?w=300&h=300\nCircular Saw Blade - Chisel Tooth\nFor sawing and clearing of gnarled bushes and thin tree trunks, reach for this special steel chisel tooth saw blade.\nThin trees\n\n\nhttps://www.stihlusa.com/products/trimmers-and-brushcutters/trimmer-heads-and-blades/supercut/?aqid=7cc82ad014514d263bcc251fea31117b\nhttps://stihlusa-images.imgix.net/Product/792/supercut.png?w=300&h=300\nSTIHL SuperCut™ Line Head\nSTIHL SuperCut™ features fully automatic line feed that keeps nylon line at the same length for optimal cutting performance.\nFarm\n\n\nhttps://www.stihlusa.com/products/trimmers-and-brushcutters/trimmer-heads-and-blades/grassblade/?aqid=7cc82ad014514d263bcc251fea31117b\nhttps://stihlusa-images.imgix.net/Product/1362/grassblade.png?w=300&h=300\nGrass Cutting Blade\nFor mowing of thick, dry grass and reeds, try the grass cutting blade in four-tooth or eight-tooth models.\nThick grass, dry grass\n\n\nhttps://www.stihlusa.com/products/trimmers-and-brushcutters/trimmer-heads-and-blades/trimcut/?aqid=7cc82ad014514d263bcc251fea31117b\nhttps://stihlusa-images.imgix.net/Product/1361/trimcut.png?w=300&h=300\nTrimCut™ Line Head\nThis manual-feed mowing head is ideal for low-growing grass around solid obstacles.\nShort grass, stones, garden\n\n\n", "22dbe4d0-42e4-4f14-9d32-84fb4e0c2ff7"]
[{"id": null, "metadata": {"doc_id": "b3470518-aa0a-4366-b8e7-951d434d7f1d", "source_file": "STIHL_FS120_Videos.csv"}, "page_content": "The table lists video links and their descriptions related to the STIHL FS120 Brush cutter / Grass cutter. The videos cover various aspects of using and maintaining the tool, including starting it, using it to cut thick grass, and greasing it with STIHL grease tubes. \n Source File: STIHL_FS120_Videos.csv", "type": "Document"}, "\n\n\nVideo Link\nVideo Description\n\n\nhttps://youtu.be/DfEhrJL91zk?si=4RivreHhdNgvKdVa\nThis video explains how to start a STIHL FS120 Brush cutter / Grass cutter\n\n\nhttps://youtu.be/n8LetxWIbY8?si=3P7I5eoACW6aaovL\nThis video shows use of STIHL FS120 Brush cutter / Grass cutter to cut thick grass\n\n\nhttps://youtu.be/I2HyKBCIjq8?si=12Ba4JGsEU8OZewl\nThis video shows how to use STIHL grease tubes to do Brush cutter / Grass cutter greasing\n\n\n", "b3470518-aa0a-4366-b8e7-951d434d7f1d"]
[{"id": null, "metadata": {"doc_id": "217223e9-0e4d-4f96-9c35-0f9738d2a9bb", "source_file": "stihl_new_products.csv"}, "page_content": "The table lists various STIHL products along with their categories, images, and prices. Here is a concise summary:\n\n1. **HL 94 Long Reach Hedge Trimmer**\n   - Category: Hedge trimmers & long-reach hedge trimmers\n   - Price: INR 61,877.00\n   - Image: ![HL 94 Long Reach Hedge Trimmer](https://www.stihl.in/content/dam/stihl/media/pim/97769.jpg)\n\n2. **HSA 50 Cordless Hedge Trimmer - AK System**\n   - Category: Hedge trimmers & long-reach hedge trimmers\n   - Price: INR 31,170.00\n   - Image: ![HSA 50 Cordless Hedge Trimmer - AK System](https://www.stihl.in/content/dam/stihl/media/pim/53152.jpg)\n\n3. **FS 230 Petrol Brushcutter**\n   - Category: Grass trimmers, brushcutters & clearing saws\n   - Price: INR 29,551.00\n   - Image: ![FS 230 Petrol Brushcutter](https://www.stihl.in/content/dam/stihl/media/pim/54850.jpg)\n\n4. **FR 230 Petrol Brushcutter**\n   - Category: Grass trimmers, brushcutters & clearing saws\n   - Price: INR 31,322.00\n   - Image: ![FR 230 Petrol Brushcutter](https://www.stihl.in/content/dam/stihl/media/pim/45627.jpg)\n\n5. **FSA 130 Cordless Brushcutter – AP System**\n   - Category: Grass trimmers, brushcutters & clearing saws\n   - Price: INR 47,901.00\n   - Image: ![FSA 130 Cordless Brushcutter – AP System](https://www.stihl.in/content/dam/stihl/media/pim/43229.jpg)\n\n6. **RE 100 Plus Control Electric Pressure Washer**\n   - Category: Pressure washers\n   - Price: INR 20,491.00\n   - Image: ![RE 100 Plus Control Electric Pressure Washer](https://www.stihl.in/content/dam/stihl/media/pim/49221.jpg)\n\n7. **WP 300 Petrol Water Pump**\n   - Category: Water pumps\n   - Price: INR 26,419.00\n   - Image: ![WP 300 Petrol Water Pump](https://www.stihl.in/content/dam/stihl/media/pim/53023.jpg)\n\n8. **WP 600 Petrol Water Pump**\n   - Category: Water pumps\n   - Price: INR 29,941.00\n   - Image: ![WP 600 Petrol Water Pump](https://www.stihl.in/content/dam/stihl/media/pim/53031.jpg)\n\n9. **WP 900 Petrol Water Pump**\n   - Category: Water pumps\n   - Price: INR 48,093.00\n   - Image: ![WP 900 Petrol Water Pump](https://www.stihl.in/content/dam/stihl/media/pim/53032.jpg)\n\n10. **SEA 20 Cordless Hand Vacuum - AS System**\n    - Category: Wet & dry vacuums\n    - Price: INR 8,035.00\n    - Image: ![SEA 20 Cordless Hand Vacuum - AS System](https://www.stihl.in/content/dam/stihl/media/pim/55396.jpg) \n Source File: stihl_new_products.csv", "type": "Document"}, "\n\n\nm_category-overview-tiles__item href\nproduct-image__picture src\nproduct-image\ntile_product-standard__title\ntile_product-standard__category\nprice-value\n\n\nhttps://www.stihl.in/en/p/hedge-trimmers-long-reach-hedge-trimmers-hl-94-long-reach-hedge-trimmer-74075#hl-94-c-e-74075\nhttps://www.stihl.in/content/dam/stihl/media/pim/97769.jpg\n<img src=\"/content/dam/stihl/media/pim/97769.jpg\" alt=\"HL 94 LONG REACH HEDGE TRIMMER\"/>\nHL 94 LONG REACH HEDGE TRIMMER\nHedge trimmers & long-reach hedge trimmers\nINR 61,877.00\n\n\nhttps://www.stihl.in/en/p/hedge-trimmers-long-reach-hedge-trimmers-hsa-50-ak-system-157866#hsa-50-with-ak-20-battery-and-al-101-charger-157866\nhttps://www.stihl.in/content/dam/stihl/media/pim/53152.jpg\n<img src=\"/content/dam/stihl/media/pim/53152.jpg\" alt=\"HSA 50 Cordless Hedge Trimmer - AK System\"/>\nHSA 50 Cordless Hedge Trimmer - AK System\nHedge trimmers & long-reach hedge trimmers\nINR 31,170.00\n\n\nhttps://www.stihl.in/en/p/brushcutters-grass-trimmers-clearing-saws-fs-230-petrol-brushcutter-84172#fs-230-84172\nhttps://www.stihl.in/content/dam/stihl/media/pim/54850.jpg\n<img src=\"/content/dam/stihl/media/pim/54850.jpg\" alt=\"FS 230\"/>\nFS 230 Petrol Brushcutter\nGrass trimmers, brushcutters & clearing saws\nINR 29,551.00\n\n\nhttps://www.stihl.in/en/p/brushcutters-grass-trimmers-clearing-saws-fr-230-petrol-brushcutter-84179#fr-230-84179\nhttps://www.stihl.in/content/dam/stihl/media/pim/45627.jpg\n<img src=\"/content/dam/stihl/media/pim/45627.jpg\" alt=\"FR 230\"/>\nFR 230 Petrol Brushcutter\nGrass trimmers, brushcutters & clearing saws\nINR 31,322.00\n\n\nhttps://www.stihl.in/en/p/brushcutters-grass-trimmers-clearing-saws-fsa-130-ap-system-76259#fsa-130-without-battery-and-charger-76259\nhttps://www.stihl.in/content/dam/stihl/media/pim/43229.jpg\n<img src=\"/content/dam/stihl/media/pim/43229.jpg\" alt=\"FSA 130 Cordless Brushcutter – AP System\"/>\nFSA 130 Cordless Brushcutter – AP System\nGrass trimmers, brushcutters & clearing saws\nINR 47,901.00\n\n\nhttps://www.stihl.in/en/p/pressure-washers-re-100-plus-control-electric-pressure-washer-141961#re-100-plus-control-141961\nhttps://www.stihl.in/content/dam/stihl/media/pim/49221.jpg\n<img src=\"/content/dam/stihl/media/pim/49221.jpg\" alt=\"RE 100 PLUS CONTROL\"/>\nRE 100 Plus Control Electric Pressure Washer\nPressure washers\nINR 20,491.00\n\n\nhttps://www.stihl.in/en/p/water-pumps-wp-300-petrol-water-pump-155020#wp-300-155020\nhttps://www.stihl.in/content/dam/stihl/media/pim/53023.jpg\n<img src=\"/content/dam/stihl/media/pim/53023.jpg\" alt=\"WP 300 Petrol Water Pump\"/>\nWP 300 Petrol Water Pump\nWater pumps\nINR 26,419.00\n\n\nhttps://www.stihl.in/en/p/water-pumps-wp-600-petrol-water-pump-155018#wp-600-155018\nhttps://www.stihl.in/content/dam/stihl/media/pim/53031.jpg\n<img src=\"/content/dam/stihl/media/pim/53031.jpg\" alt=\"WP 600 Petrol Water Pump\"/>\nWP 600 Petrol Water Pump\nWater pumps\nINR 29,941.00\n\n\nhttps://www.stihl.in/en/p/water-pumps-wp-900-petrol-water-pump-155019#wp-900-155019\nhttps://www.stihl.in/content/dam/stihl/media/pim/53032.jpg\n<img src=\"/content/dam/stihl/media/pim/53032.jpg\" alt=\"WP 900 Petrol Water Pump\"/>\nWP 900 Petrol Water Pump\nWater pumps\nINR 48,093.00\n\n\nhttps://www.stihl.in/en/p/wet-dry-vacuum-cleaners-sea-20-cordless-hand-vacuum-as-system-146275#sea-20-without-battery-and-charger-146275\nhttps://www.stihl.in/content/dam/stihl/media/pim/55396.jpg\n<img src=\"/content/dam/stihl/media/pim/55396.jpg\" alt=\"SEA 20 Cordless Hand Vacuum - AS System\"/>\nSEA 20 Cordless Hand Vacuum - AS System\nWet & dry vacuums\nINR 8,035.00\n\n\n", "217223e9-0e4d-4f96-9c35-0f9738d2a9bb"]
[{"id": null, "metadata": {"doc_id": "f2f34416-1c0b-45a8-8a3f-aaf7f4d3ab2c", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This table of contents outlines the sections of a manual, likely for a power tool or similar equipment. Key sections include:\n\n1. **Guide to Using the Manual** - Instructions on how to navigate the manual.\n2. **Safety Precautions and Working Techniques** - Essential safety guidelines and techniques for using the tool.\n3. **Approved Combinations of Cutting Attachments, Deflector, Handle, and Harness** - Lists compatible parts and configurations.\n4. **Mounting Instructions** - Detailed steps for mounting various handles, deflectors, and cutting attachments.\n5. **Fuel and Fueling** - Information on the type of fuel to use and how to refuel the machine.\n6. **Operating Instructions** - Guidelines for starting, stopping, and operating the engine.\n7. **Maintenance and Care** - Instructions for routine maintenance, including adjusting the throttle cable, fitting the harness, balancing the machine, and more.\n8. **Inspection and Maintenance** - Tasks for both users and dealers to ensure the machine remains in good working condition.\n9. **Minimizing Wear and Avoiding Damage** - Tips to prolong the life of the machine.\n10. **Specifications and Parts** - Technical specifications and a list of main parts.\n11. **Disposal and Compliance** - Information on proper disposal and regulatory compliance.\n\nThis manual is comprehensive, covering everything from initial setup and operation to maintenance and troubleshooting. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Contents 1 2 Guide to Using this Manual.........................2 Safety Precautions and Working Techni‐ ques............................................................ 2 Approved Combinations of Cutting Attach‐ ment, Deflector, Handle and Harness....... 12 4 Approved Power Tool Attachments.......... 13 5 Mounting the Bike Handle.........................13 6 Mounting the Loop Handle........................15 Adjusting the Throttle Cable......................16 7 Fitting the Carrying Ring........................... 17 8 9 Mounting the deflector.............................. 18 10 Mounting the Cutting Attachment..............19 11 Fuel........................................................... 22 12 Fueling...................................................... 23 13 Fitting the Harness....................................23 14 Balancing the Machine..............................25 15 Starting / Stopping the Engine.................. 26 16 Transporting the Unit................................ 28 17 Operating Instructions...............................30 18 Air filter......................................................31 19 Adjusting the Carburetor........................... 31 20 Spark Plug................................................ 32 21 Engine Running Behavior......................... 33 22 Lubricating the Gearbox............................33 23 Replacing the Starter Rope and Rewind 3 Spring........................................................34 24 Storing the Machine.................................. 35 25 Sharpening Metal Cutting Blades............. 36 26 Maintaining the Mowing Head...................36 27 Inspection and Maintenance by User........37 28 Inspections and Maintenance by Dealer...37 29 Maintenance and Care..............................38 30 Minimize Wear and Avoid Damage...........39 31 Main Parts.................................................40 32 Specifications............................................40 33 Maintenance and Repairs......................... 42 34 Disposal.................................................... 42 35 EC Declaration of Conformity................... 42 36 Addresses................................................. 42", "f2f34416-1c0b-45a8-8a3f-aaf7f4d3ab2c"]
[{"id": null, "metadata": {"doc_id": "67edabed-7b90-4aa1-aea5-25a18b851a9b", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "It appears that you have provided a heading or title, \"NOTICE,\" but there is no accompanying table or text chunk to summarize. Please provide the content or table you would like summarized. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "NOTICE", "67edabed-7b90-4aa1-aea5-25a18b851a9b"]
[{"id": null, "metadata": {"doc_id": "60f518bf-f1df-4a76-819f-adad58c51904", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The table provides a conversion chart for mixing STIHL two-stroke engine oil at a 1:50 ratio with gasoline. It lists the required amount of oil in liters (and milliliters) for various quantities of gasoline, ranging from 1 to 25 liters. For example, 1 liter of gasoline requires 0.02 liters (20 ml) of oil, while 25 liters of gasoline require 0.50 liters (500 ml) of oil. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Quantity of gaso- STIHL two-stroke line engine oil 1:50 Liters Liters (ml) 1 0.02 (20) 5 0.10 (100) 10 0.20 (200) 15 0.30 (300) 20 0.40 (400) 25 0.50 (500)", "60f518bf-f1df-4a76-819f-adad58c51904"]
[{"id": null, "metadata": {"doc_id": "2d14d049-1d56-44ea-bcdc-4993c41d631a", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The table appears to be a maintenance checklist for a machine, detailing various components and actions to be taken at different intervals. Key components include the manual fuel pump, fuel pickup body, and intake port for cooling air. Actions include visual inspections, cleaning, replacing damaged parts, function tests, and adjustments. The table specifies that some tasks should be performed annually, while others are to be done before or after each use. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Complete machine Manual fuel pump (if present) Fuel pickup body in fuel tank Visual inspection (condi‐ tion, leaks) Clean Replace any damaged parts Function test Visual inspection Clean replace check Have repaired by a spe‐ cialist dealer1) check replace Clean Check idle adjustment, cutting attachment must not turn Adjust idle speed Set electrode gap Replace after every 100 hours of operation Intake port for cooling air Visual inspection Clean e r o f e B l i a d r o / d n a k r o w f o d n e l l i f e r s i k n a t r e v e n e h W l l l l a u n n A f I f I s A e h t t A X X X X X X X X X X X X X X X X X X X X X X X X X X X", "2d14d049-1d56-44ea-bcdc-4993c41d631a"]
[{"id": null, "metadata": {"doc_id": "58a2f8ff-1b61-48ab-bfbe-c9e3d2463d1d", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided table appears to be a maintenance checklist for a piece of equipment, likely a power tool or machinery. It includes various components such as screws, nuts, bolts, anti-vibration elements, cutting attachments, and gearbox lubrication. The table specifies different maintenance actions like tightening, checking, replacing, visually inspecting, sharpening, and topping up lubrication. These actions are to be performed either by the user or a servicing dealer. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "e r o f e B l i a d r o / d n a k r o w f o d n e l l i f e r s i k n a t r e v e n e h W l l l l a u n n A f I f I s A e h t t A All accessible screws, nuts and bolts (not adjusting screws) Anti-vibration elements Cutting attachment Metal cutting attachment Gearbox lubrication (with screw plug) Tighten Check2) Have replaced by serv‐ icing dealer1) Visual inspection replace Check for secure fit sharpen check top up replace X X X X X X X X X X X X X X X X X", "58a2f8ff-1b61-48ab-bfbe-c9e3d2463d1d"]
[{"id": null, "metadata": {"doc_id": "2ad755d2-808f-4443-bec2-617ca41b9faa", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text appears to list specifications for a mechanical device, likely a power tool or engine. It includes measurements and various speed ratings:\n\n- Two size measurements: 35 mm and 32 mm.\n- Idle speed: 2,800 rpm.\n- Cut-off speed (rated): 9,000 rpm.\n- Maximum output shaft speed (cutting attachment): 12,300 rpm.\n- Another speed rating: 9,150 rpm. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "35 mm 32 mm Idle speed: Cut-off speed (rated): Max. output shaft speed (cutting attachment): 9,000 rpm 2,800 rpm 12,300 rpm 9,150 rpm", "2ad755d2-808f-4443-bec2-617ca41b9faa"]
[{"id": null, "metadata": {"doc_id": "31235d9e-5a66-4909-917a-fdc41fcc75aa", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "This text provides specifications for a mechanical device, likely an engine or motor. It includes the following details:\n\n- Displacement: 40.2 cc\n- Bore: 40 mm\n- Stroke: 32 mm\n- Idle speed: 2,800 rpm\n- Cut-off speed (rated): 9,000 rpm\n- Maximum output shaft speed (cutting attachment): 12,300 rpm\n- Maximum output shaft speed: 9,150 rpm \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "40.2 cc 40 mm 32 mm Idle speed: Cut-off speed (rated): Max. output shaft speed (cutting attachment): 9,000 rpm 2,800 rpm 12,300 rpm 9,150 rpm", "31235d9e-5a66-4909-917a-fdc41fcc75aa"]
[{"id": null, "metadata": {"doc_id": "a69e3d4c-0198-42c2-aea0-975b8dbf29d0", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The provided text appears to list different models of equipment (FS 120, FS 120 R, FS 250) in the context of being \"dry, without cutting attachment and deflector.\" This likely refers to the specifications or conditions under which these models are being described or compared. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Dry, without cutting attachment and deflector FS 120: FS 120 R: FS 250:", "a69e3d4c-0198-42c2-aea0-975b8dbf29d0"]
[{"id": null, "metadata": {"doc_id": "213bc9cc-79bb-4a64-9993-14562645b98d", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The given text chunk lists two sound levels: 98 dB(A) and 102 dB(A). These values likely represent measurements of noise or sound intensity, with \"dB(A)\" indicating that the measurements are weighted according to the A-weighting scale, which adjusts for the sensitivity of human hearing. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "98 dB(A) 102 dB(A)", "213bc9cc-79bb-4a64-9993-14562645b98d"]
[{"id": null, "metadata": {"doc_id": "453d3206-ba9b-47c9-ab84-6f2e71db9712", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The given text chunk indicates a noise level measurement of 109 decibels (A-weighted) repeated twice. This suggests a consistent noise level of 109 dB(A). \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "109 dB(A) 109 dB(A)", "453d3206-ba9b-47c9-ab84-6f2e71db9712"]
[{"id": null, "metadata": {"doc_id": "15fb0fb6-a1f6-4633-a073-d12b9f467689", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The table provides vibration levels (measured in meters per second squared, m/s²) for different models of a mowing tool (FS 120, FS 120 R, FS 250) when used with a mowing head or a metal mowing tool. The vibration levels are listed separately for the left and right handles. For example, with a mowing head, the FS 120 model has a vibration level of 6.3 m/s² on the left handle and 5.0 m/s² on the right handle. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "32.7.3 with mowing head Handle, left Handle, FS 120: FS 120 R: FS 250: 6.3 m/s2 8.0 m/s2 5.7 m/s2 right 5.0 m/s2 9.0 m/s2 4.3 m/s2 with metal mowing tool FS 120: FS 120 R: Handle, left Handle, 4.9 m/s2 9.5 m/s2", "15fb0fb6-a1f6-4633-a073-d12b9f467689"]
[{"id": null, "metadata": {"doc_id": "c37f6a2d-af73-44e6-8c90-d065e66cc84b", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The table lists details about STIHL brushcutters, specifically the FS 120 and FS 250 models. It includes columns for designation, make, series, serial identification number, and displacement. \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "Designation: Make: Series: Serial identification number: Displacement FS 120: FS 250: Brushcutter STIHL FS 120 FS 250 4134", "c37f6a2d-af73-44e6-8c90-d065e66cc84b"]
[{"id": null, "metadata": {"doc_id": "b329c9b3-a906-45f0-99c8-7eab7bcb42ca", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The given text lists two items, FS 120 and FS 250, both with a noise level of 112 dB(A). \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "FS 120: 112 dB(A) FS 250: 112 dB(A)", "b329c9b3-a906-45f0-99c8-7eab7bcb42ca"]
[{"id": null, "metadata": {"doc_id": "bf32e8cc-a42f-40af-8f1d-ed37920e21ee", "source_file": "FS120_instruction_manual.pdf"}, "page_content": "The table lists two items, FS 120 and FS 250, both with a noise level of 114 dB(A). \n Source File: FS120_instruction_manual.pdf", "type": "Document"}, "FS 120: 114 dB(A) FS 250: 114 dB(A)", "bf32e8cc-a42f-40af-8f1d-ed37920e21ee"]
